{
  "documents": [
    "Chapter 1. Introduction\nРевизия VCS: 3c3e04345\nДата сборки документа: \n\t\t\t\t\t2023.11.09 17:03:53\nARTA SYNERGY management platform allows building full cycle of company\nmanagement from setting objectives to planning, from control of execution to\ncollection and assessment of results. The platform has single storage for\ncontent, knowledge base, quick semantic information search and other\nfeatures. In other words, everything necessary for support of interaction\nbetween people jointly collaborating over common assignments.",
    "Chapter 1. Introduction\nРевизия VCS: 3c3e04345\nДата сборки документа: \n\t\t\t\t\t2023.11.09 17:03:53\nARTA SYNERGY management platform allows building full cycle of company\nmanagement from setting objectives to planning, from control of execution to\ncollection and assessment of results. The platform has single storage for\ncontent, knowledge base, quick semantic information search and other\nfeatures. In other words, everything necessary for support of interaction\nbetween people jointly collaborating over common assignments.",
    "Chapter 2. Terms, abbreviations and legend\nРевизия VCS: 3c3e04345\nДата сборки документа: \n\t\t\t\t\t2023.11.09 17:03:53\nуправленческая платформа, которая позволяет в кратчайшие сроки выстроить\nполный цикл управления и оптимизировать основную деятельность организации\n(далее-Система).\nпроцедура допуска в закрытую часть Системы на основе выполнения\nпользователем Системы и Системой регламентных процедур.\nпользователь системы, имеющий повышенный уровень привилегий в системе, с\nпомощью которых он может изменять настройки системы и управлять\nпользовательскими учетными записями.\nпользователь системы, который обладает правом работы в системе с заданным\nнабором документов, журналов, справочников и электронной почтой, согласно\nего роли в организационной структуре.\nкомпьютер, подключенный к сети Интернет, предоставляющий клиентам доступ к\nобщим информационным ресурсам Системы и управляющий этими ресурсами.\nсписок однотипных объектов, относящихся к одной тематике и часто\nиспользуемые в системе.\nэто специальный раздел системы, в котором хранятся личные данные\nпользователя.\nпостоянное именованное множество сотрудников и/или подразделении.\nатомарное действие сотрудника, которое необходимо выполнить в рамках одного\nдня и используется для планирования личного рабочего времени.\nдействие сотрудника, которое может содержать множество Задач, иметь\nпродолжительность более одного дня, а также нести с собой дополнительную\nинформацию в виде документов и комментариев.\nповторяющаяся продолжительность Работ и/или Задач, которая имеет общую для\nвсех входящих в состав Работ дополнительную информацию: документы,\nкомментарии, историю исполнения Работ и/или Задач, а также другие\nопцианальные атрибуты.\nструктурированный список запланированных Работ, направленный на достижение\nЦелей.\nструктурированный список взаимосвязанных Проектов, направленных на\nдостижение одних Целей.\nжелаемое состояние организации или подразделения или сотрудника, выраженное\nчерез Показатели, которое может содержать в себе Портфели проектов, Проекты\nили Работы.\nколичественная характеристика состояния какого-либо объекта или явления.\nмногократно используемый набор Работ и правил переходов, связанных\nпоследовательно и/или параллельно, направленных на достижение заранее\nопределённого результата.\nэто аналог собственноручной подписи. ЭЦП используется для придания\nэлектронному документу юридической силы, равной юридической силе документа\nна бумажном носителе, подписанного собственноручной подписью правомочного\nлица и скрепленного печатью.",
    "Chapter 3. General information\nРевизия VCS: 3c3e04345\nДата сборки документа: \n\t\t\t\t\t2023.11.09 17:03:53\nTable of Contents\nЗадачи, решаемые Платформой\nStorage and search of information;\nCollective time management;\nControl and accounting of assignments;\nDocument management;\nProject management;\nRequest management;\nStrategic management;\nEfficiency assessment;\nIntra-corporate messaging.",
    "Disposition of document\nThe document is designed to describe actions of users of the System aimed at\nplanning and distribution of work time.",
    "System composition\nThe System contains the following modules:\n\"Work flow\" module is designed to create, manage and control jobs both\nplanned and emergency.\n\"Daily planner\" module is designed :\nto plan assignments with duration of less than one day;\nto call workers for a meeting;\nto control working day of subordinates.\n\"Storage\" module includes three main sections:\n«Файлы» - хранилище, предназначенное для загрузки, просмотра и поиска\nтекстовых, видео и аудио файлов, графических изображений.\n«Реестры» - это способ отображения структурированных данных на основе\nформ(раздел отображается у пользователей с соответствующими правами\nдоступа).\nРаздел «Документы» автоматизирует регистрацию входящих, исходящих и\nвнутренних документов, также позволяет получать и отправлять электронную\nпочту, группировать зарегистрированные документы в дела и хранить их\nсогласно номенклатуре дел.\n\"Project\" module is designed to create, edit, distribute and control\narrangements within a project. Commodity of planned actions aimed at\nachieving one final objectives within limited time, resources and budget.\n\"Objectives and indicators\" module is designed to monitor progress of\nachieving strategic objectives of the company, their assessment and\nmonitoring. The module allows to form and decompose strategic objectives of\ncompany, to form arbitrary maps of gauges, to develop dictionary of\nindicators and to input their values.\nМодуль «Сотрудники» состоит из трех основных разделов:\n«Организационная структура» отражает занятость сотрудников по их записям в\nежедневнике и загруженность в соответствии с выставленными работами. Помимо\nэтого, содержится информация о сотруднике, его контакты и дополнительная\nинформация о нем.\n«Резерв» предназначен для просмотра пользователей не назначенных на\nдолжность и удаленных, а также для создания новых пользователей в системе.\n«Адресная книга» - контакты о людях и организациях, как личные так и\nобщедоступные.\n\"Settings\" module provides features to change settings of the System and\nlimiting access rights of the users to the System resources.",
    "Chapter 4. Work of employees in the System\nРевизия VCS: 3c3e04345\nДата сборки документа: \n\t\t\t\t\t2023.11.09 17:03:53\nTable of Contents\nLog in to the System\nДля входа в приложение откройте любой доступный web-браузер и в адресной\nстроке введите адрес сервера системы «ARTA SYNERGY» (Вводится IP адрес\nкомпьютера, на котором установлен «ARTA SYNERGY», например,\nhttps://192.168.1.5/Synergy). При необходимости указываются порты.\nПри переходе по адресу должна отобразиться страница, изображенная на рисунке\nниже. Это страница аутентификации пользователя Системы.  Введите имя вашей\nучетной записи в поле «Логин» и ваш персональный пароль для доступа к\nСистеме в соответствующее поле.\nПосле ввода авторизационных данных нажмите на клавишу «Enter» на клавиатуре\nили кнопку «Войти» на странице. Если при вводе данных вы допустили ошибку,\nСистема уведомит вас об этом.\nFigure 4.1. Страница аутентификации\nВ правом верхнем углу на данной странице находятся ссылки для изменения\nязыка Системы. Выделенная ссылка указывает на язык, на котором пользователю\nбудет отображаться информация. Для того, чтобы изменить язык, необходимо\nперейти по соответствующей ссылке.\nТакже у пользователя есть возможность восстановить забытый пароль.  Для\nэтого необходимо на ссылку «Забыли пароль?» на страницы.  Система\nперенаправит пользователя на страницу, на которой необходимо ввести имя\nвашей учетной записи в поле «Логин». После нажатия на кнопку «Отправить» на\nпочту, указанную в Вашей учетной записи, будет отправлено письмо с новым\nпаролем и инструкцией по восстановлению.\nПри вводе неверного пароля допуск в Систему будет запрещен. Для\nпредотвращения возможности подбора пароля для входа в Систему, в настройках\nбезопасности предусмотрено указание количества неудачных попыток входа (с\nодного IP адреса), ответ Системы задерживается на указанное время в таймауте\nпри достижении количества неудачных попыток, далее время ответа\nувеличивается пропорционально прогрессивному таймауту (например, t*2+1).\nВ базу можно добавлять любое количество пользователей, но при этом\nколичество пользователей с доступом в систему не может привышать количество\nлицензий. В случае, если это количество уже исчерпано, при создании\nпользовательской учетной записи или при добавлении прав доступа в систему\nпользователю который его не имел ранее, выводится предупреждение о том, что\nлицензии исчерпаны и новый пользователь не сможет войти в Систему,\nсоответственно положение опции «Доступ в систему» автоматически меняется на\n«Блокирован».",
    "Main interface elements\nПосле аутентификации открывается модуль по умолчанию, установленный в\nпользовательских настройках. Некоторые элементы управления присутствуют\nпостоянно и не меняются в зависимости от активного на данный момент модуля,\nэто:\nОбласть поиска на панели сверху.\nКнопка «Настройки» в правом верхнем углу.\nКнопка выхода, находящаяся также в правом вернем углу, позволяет выйти из\nСистемы на страницу аутентификации пользователя.\nКнопка «Домой» в левом нижнем углу. Данная кнопка применима для сварачивания\nпросматриваемых документов в Системе.\nИндикатор состояния соединения с сервером и кнопка вызова IM-клиента,\nнаходящиеся в правом нижнем углу браузера.  Индикатор отображает среднюю\nэффективность соединения с сервером в процентах. Кнопка вызова IM-клиента\nвызывает и скрывает основное окно модуля обмена мгновенными сообщениями (в\nзависимости от настроек Системы, кнопка может отсутстовать).\nКнопка контекстной справки , находящаяся также в правом нижнем углу,\nсодержит разделы:\n«Справка» - контекстная информация о функциях и опциях каждого из модулей.\n«О программе» - информация о программе. Включает в себя краткое описание\nосновных модулей системы, а также ссылки на официальную документацию Системы\n(htmlиpdfверсии руководств пользователя, методолога и\nадминистратора) и официальный сайт производителя.\n«Что нового» - информация об изменениях в новой сборке.\n«Быстрый старт» - краткая информация о всех модулях в системе.\n«Отправить запрос» - возможность отправить запрос службе поддержки при\nсоответствующих настройках сервера отправки уведомлений (сообщения об\nошибках, запрос на изменение функционала).\nКросс-модульная кнопка в левом верхнем углу, которая состоит из\nнастраиваемых групп/пунктов и стандартных пунктов, которые меняют свое\nсодержание в зависимости от выбранного модуля.\nРабочее место пользователя позволяет получить доступ к следующим модулям:\n«Потоки работ», «Ежедневник», «Хранилище» «Проекты», «Цели и показатели»,\n«Сотрудники». Панель «Навигатор» отображается всегда и его содержимое\nменяется в зависимости от активного модуля.",
    "Chapter 5. \"Work flows\" module\nРевизия VCS: 3c3e04345\nДата сборки документа: \n\t\t\t\t\t2023.11.09 17:03:53\nTable of Contents\nWork flows\nМодуль «Потоки работ» предназначен для создания, управления и контроля работ\nкак плановых, так и внеплановых (см. илл. «Потоки работ»). Данный модуль\nобеспечивает постановку и своевременный контроль исполнения работы, для\nэффективного выполнения поставленной задачи руководителем. Переход в модуль\nосуществляется нажатием на кнопку «Потоки работ» в верхней панели.\nFigure 5.1. Work flows\nDisplayed panels\nПанель позволяет сформировать отчёт и открыть панель подробной информации о\nработе. На иконке потоков работ (также в модуле хранилище) в красном\nкружочке Система уведомляет о количестве новых событий (постановка\nруководителем новой работы, изменение руководителем или другими сотрудниками\nстатуса и прогресса исполнения работы и т.д.). Также при появлении новых\nсобытий браузер мигает с заголовком «NEW!». Мигание браузера по желанию\nможет быть отключено в пользовательских настройках.\nОсновная рабочая область содержит динамический список потоков работ, который\nотображается не постранично, а путем подгрузки всех работ до достижения\nконца списка. Также основная рабочая область содержит панель подробной\nинформации о работе.  Основная панель позволяет выполнять некоторые действия\nнад элементами имеющегося списка работ. Сортировка работ в списке\nпроизводится по времени их поступления, поэтому изменённые и новые работы в\nсписке выделяются жирным и находятся вверху списка. В общем списке работ\nкоричневым шрифтом отображаются работы, до завершения которых осталось менее\nтрети срока исполнения, красным шрифтом отображаются просроченные работы.\nЦвету первого столбца в списке работ соответствует цвету приоритета работы\nсогласно настроек в Конфигураторе.\nPanel is located to the right of work flow list. Contains the following\nareas: \"Work information\", \"Files\", and \"Comments\".\nОбласть «Информация о работе» отображает следующую информацию:\nName;\nСроки;\nAuthor;\nОтветственный за данную работу;\nФорма завершения работы (если в качестве формы завершения выбрано“Нет”- не отображается)\nГиперссылка на мероприятие проекта (если данная работа была создана из\nмодуля“Проекты”).\nОбласть «Файлы» предоставляет доступ к документам, прикрепленным к данной\nработе. Файлы могут быть прикреплены в папки «Приложения» и\n«Прочие». Прикреплять файлы к работе можно следующими вариантами: с\nхранилища, с компьютера, создать новый текстовый документ и сканировать.\nФайл с компьютера можно загрузить не только с помощью пункта меню, но и\nперетащив необходимый файл (или несколько файлов) в область «Файлы».\nIf context menu of attached file is called (file name is bold), the\nfollowing items are available:\nDownload;\nPDF version download;\nMake main;\nNew version;\nDelete;\nСкачать все“Приложения”(для папки“Приложения”)\n/ Скачать все“Прочие”(для папки“Прочие”).\nПримечание\nЗапрещено добавлять новую версию либо удалять основной файл по форме записи\nреестра (файл по форме, который добавляется при создании реестра и\nсоответствует форме, которая указана в настройках реестра). Поэтому при\nвыборе пункта“Новая версия”контекстного меню основного файла\nпо форме записи реестра система возвращает ошибку:\nНевозможно добавить новую версию для основного\nфайла по форме\nПри выборе пункта“Удалить”для данного файла система\nвозвращает ошибку:\nНевозможно удалить основной файл по форме\nПри вызове контекстного меню панели“Файлы”доступны следующие\nопции:\nСкачать все файлы;\nСкачать все“Приложения”;\nСкачать все“Прочие”.\nДанное меню вызывается в области данной панели за исключением области\nвыделения файлов, в которой вызывается вышеописанное контекстное меню\nфайлов.\n\"Comments\" section displays and allows editing and deleting comments for\nselected work. If a work is selected, it displays:\ncomments related to the current work;\ncomments of all works which are children of the selected;\ncomments of works from the same work branch as the selected work.\nДанные комментарии делятся на три типа:\nРабота. Комментарии по работе.\nДокумент. Комментарии по документу.\nЛичные. Комментарии, которые отображаются только тому пользователю, который\nих создал.\nModule interface has visual division of works by type, status, period, etc.\nНа панели по умолчанию присутствуют следующие фильтры:\n“На исполнении”- предназначен для работ, где пользователь\nявляется ответственным за исполнение.  Сюда попадают работы от\nруководителей, согласование, утверждение, ознакомление с документами от\nдругих пользователей, а также проекты документов, созданные самим\nпользователем и работы, поставленные себе;\n“На контроле”- предназначен для работ, поставленных\nпользователем другому исполнителю, работ взятых на контроль вручную,\nкорневых работ резолюции и протокола. Сюда не попадают перепорученные\nработы, поручения резолюций, протоколов и проектов;\nThe following filters are displayed on the panel only if they match works:\n“Протокольные”- содержит протокольные поручения;\n“Проекты”- содержит работы в подфильтрах по проектам;\n“Группы”- содержит работы по группам, созданные пользователем.\nЕсли пользователь является и.о. руководителя, либо ему делегировано право на\nпросмотр работ, то после фильтра“На контроле”панель\nдополнительно содержит фильтр:\nДелегированные - содержит содержит в себе все работы из всех подфильтров по\nработам руководителя, либо делегировавших пользователей.\nЕсли пользователя увольняют с должности и.о. или отменяют делегирование прав\nна работы, панель более не будет содержать соответствующий фильтр работ\nруководителя, либо делегировавшего пользователя.\nДля перечисленных фильтров возможно изменение внешнего вида списка\nработ. Для этого нужно выделить фильтр, вызвать контекстное меню и выбрать\nиз списка пункт «Изменить».  Изменению подлежат отображаемые поля,\nсортировка полей по возрастанию и убыванию, а также раскрытие ветки его\nподфильтров.\nФильтр «На исполнении» по умолчанию содержит следующие подфильтры:\nFor signature;\nControl;\nOverdue;\nCompleted.\nФильтр «На контроле» по умолчанию разбивается на подфильтры по исполнителям.\nIn \"Execution\", \"Controlled\" filters there is a possibility to create\nspecialized sub-filters with possibility to add one or more filtering\nconditions.\nПодфильтры могут быть созданы внутри основных фильтров либо других\nподфильтров при помощи контекстного меню (выделить нужный подфильтр) — для\nосновных фильтров «Добавить…» (добавляет подфильтр), для подфильтров -\n«Добавить…» (добавляет вложенный подфильтр), «Изменить…» (можно добавить,\nудалить и изменить содержимое условий выделенного подфильтра) и «Удалить»\n(удаляет выделенный подфильтр).\nFigure 5.2. Adding filter\nFigure 5.3. Editing filter\nFigure 5.4. Редактирование фильтра“На контроле”\nConditions for \"Execution\", \"Controlled\" sub-filters:\nСо словами — регистронечувствительно, при соответствии любому из слов,\nразделённых пробелом.\nБез слов — регистронечувствительно, при несоответствии любому из слов,\nразделённых пробелом.\nТип — при соответствии любому из комбинации из четырёх типов: «Работа»,\n«Согласование», «Ознакомление», «Утверждение».\nАвтор — соответствие любому из выбранной комбинации пользователей.\nСрок — выбор одного из двух вариантов: «До конца осталось» (+ поле для\nколичества дней) либо «Просроченные».\nПрогресс — в случае, если в системе активирована настройка «Использовать\nсправочник значений прогресса для поручений», значения поля могут быть\nвыбраны только из этого справочника, в противном случае задается диапазон\nот/до (%).\nСтатус — выбор одного из трех вариантов «В работе (ожидание)», «Завершенные»\nи «Удалённые». При выборе «Завершенные» добавляются 2 флажка: «Успешно» и\n«Неуспешно». Для включенного флажка «Успешно» в фильтр попадают все\nзавершенные работы по неальтернативным процессам (тип действия «работа»,\n«резолюция», «ознакомление»), а также успешно завершенные работы по\nальтернативным процессам (согласовано, утверждено, зарегистрировано). А для\nвключенного флажка «Неуспешно» в фильтр попадают оставшиеся неуспешно\nзавершенные работы по альтернативным процессам (не согласовано, не\nутверждено, не зарегистрировано).\nСвойства — соответствие любой из комбинации опций «Контрольные», «При\nналичии файлов».\nПриоритет — соответствие любой из комбинации приоритетов, настроенных в\nКонфигураторе.\nПериод: выбор одного из вариантов: «Сегодня», «Будущая неделя», «Будущий\nмесяц», «Будущий квартал», «Последняя неделя», «Последний месяц», «Последний\nквартал» и «Произвольный период». При выборе варианта «Произвольный период»\nпоявляется возможность указать две даты - начала и завершения произвольного\nпериода. Кроме этого, для этого условия можно указать одну из опций: «По\nдате начала», «По дате планового завершения», «По дате фактического\nзавершения» или «Все».\nAssignee — matching any selected combinations of users.\nТип документа — соответствие любому из выбранной комбинации типов документа.\nSelection of fields to display:\nAssignee;\nAuthor;\nStart date;\nCompletion date;\nElapsed;\nProgress.\nFields to sort by:\nDate of change;\nStatus;\nPriority;\nName;\nStart date;\nCompletion date;\nElapsed;\nAssignee;\nAuthor;\nProgress.\nДля сортировки по прогрессу используется текущее значение прогресса\nработ. Для тех элементов потоков работ, где значение прогресса явным образом\n(ручным вводом, справочником, слайдером) не задается, значение прогресса\nопределено так:\nстатусы незавершенных работ (“ожидание”,“резолюция”и пр.) равнозначны прогрессу 0%;\nстатусы работ, завершенных как успешно (“ознакомился”,\nзарегистрировано“,”завершено\" и пр.), так и не успешно\n(“не согласен”,“не зарегистрировано”и пр.),\nравнозначны прогрессу 100%.\nОпция «Раскрыть вложенные»: если соответствующая\nгалочка включена в каком-либо фильтре, и этот фильтр имеет вложенные, то\nсоответствующий фильтр при открытии Системы будет раскрытым вместе со всеми\nего подфильтрами. По умолчанию, раскрыты дочерние фильтры у фильтров“На исполнении”и“На контроле”.\nОпция «Дополнительно отображать работы, в которых я являюсь\nавтором»(только для дочерних фильтров“На\nконтроле”): если соответствующая галочка включена, такой подфильтр\nдолжен содержать:\nвсе работы из корневого фильтра“На контроле”;\nвсе работы, в которых авторизованный пользователь является автором.\nОпция“Разделять пофамильно работы, взятые на контроль\nвручную”(только для корневного фильтра“На\nконтроле”): если соответствующая галочка включена, то незавершенные\nработы, взятые на контроль вручную (через модуль“Сотрудники”),\nбудут отображаться в тех же подфильтрах по ответственным, что и остальные\nконтрольные работы. Галочка по умолчанию выключена.\nПримечание\nWhen creating new sub-filter by default no condition is added. Any condition\ncan be added once only. When adding several conditions to sub-filter,\ndefined rules act simultaneously. In \"Projects\", \"Protocol\", and \"Groups\"\nfilters there is no possibility to create sub-filters.\nНастроенные подфильтры разделов“На исполнении”и“На\nконтроле”можно сбросить и вернуть к первоначальному состоянию,\nнастроенному методологом системы.  Для сброса настроек фильтра нужно вызвать\nконтекстное меню соответствующего фильтра и выбрать пункт“Вернуть\nнастройки”. Откроется диалог с возможностью вернуть один или\nнесколько шаблонных фильтров, также можно удалить все фильтры с внесенными\nизменениями пользователя.\nFigure 5.5. Filter edit dialog\nПримечание\nЕсли изменить условия дефолтных подфильтров и при сбросе настроек не указать“Удалить мои фильтры”- то редактированные фильтры будут\nдублироваться. Один подфильтр будет дефолтный, второй - с измененными\nнастройками.\nДля фильтров можно задать / сменить иконку с помощью диалога редактирования\nфильтра для подфильтров разделов «На исполнении» и «На контроле» (в случае\nраздела «На контроле» только для подфильтров, созданных\nвручную). Задать/изменить иконку для фильтра можно, выбрав нужную иконку из\nнабора иконок в диалоге редактирования фильтра. По умолчанию для нового\nсоздаваемого фильтра задается иконка в виде обычной папки. Первым элементом\nв выборе является выбор «без иконки».\nФильтр «Делегированные» содержит следующие подфильтры:\n%Фильтр_по_работам_делегировавшего_пользователя%;\nНа исполнении;\nFor signature;\nControl;\nOverdue;\nЗавершенные;\nНа контроле;\nПротокольные.\nПодфильтры всех уровней имеют счетчики. Фильтр по работам делегировавшего\nпользователя содержит тот же список работ, что и его дочерний фильтр“На исполнении”.\nЭти подфильтры невозможно удалить, либо создать для них дочерние. Изменение\nвнешнего вида списка работ возможно только для подфильтров по работам\nделегировавших пользователей. Для этого нужно выделить фильтр, вызвать\nконтекстное меню и выбрать из списка пункт «Изменить».  Изменению подлежат\nотображаемые поля, сортировка полей по возрастанию и убыванию, а также\nраскрытие ветки подфильтров.\nFigure 5.6. Filters\nFilters (hereinafter referred to as \"Search filters\") in left bottom corner\nhas the following control elements:\nSelection of the period: executed, today, future week, future month, future\nquarter, last week, last month, last quarter and arbitrary period; if the\nlatter is selected tow input fields are active: beginning date and finishing\ndate;\n\"Show deleted\" option;\n\"Show completed\" option;\nSelection of search type: \"By start date\", \"By finish date\", \"By actual\ncompletion date\" or \"All\".\nПри изменении значений поискового фильтра подфильтр, к которому они\nприменяются, выделяется звёздочкой (*).\nCreating work, document project, protocol\nДля того, чтобы создать работу, необходимо нажать кнопку «Создать» на\nверхней панели, либо кнопку с выпадающим списком рядом с кнопкой «Создать» и\nвыбрать любой другой пункт диалога создания работы. Появляется окно для\nсоздания работы. (см.  илл. «Окно создания новой работы»). Здесь вводится:\nWork description;\nAssignee;\nExecutors;\nTerms of start and finish (date and time);\nПриоритет (список возможных значений определяется методологом в\nКонфигураторе).\nПримечание\nПоля, обязательные для заполнения в диалоге создания работы отмечены\nзвездочкой (*).\nFigure 5.7. New work creation window\nПо нажатию кнопки открывается второй шаг. Здесь вводится:\nWorkload: % or hours of working time;\nWork comment;\nKeywords (to search);\nAttached (enclosed) documents;\nПовторение работы (по умолчанию - нет);\nФорма завершения (по умолчанию - нет).\nFigure 5.8. New work creation window (step 2)\nПримечание\nКоличество, а также порядок полей диалога создания работы может отличаться в\nзависимости от выбранного пункта в контекстном меню кнопки“Создать”.\nПоле «Ответственный» в окне создания работы по умолчанию является пустым для\nтого, чтобы по ошибке не поставить работу самому себе без возможности\nизменения ответственного.  Если флажок рядом с полем“Ответственный”выключен, то поле становится не активным. Если\nфлажок активирован, то оно обязательное для заполнения. Поле «Исполнители»\nможет содержать несколько сотрудников, для того, чтобы выбрать пользователей\nнужно выделить их, а для отмены снять выделения. При активации опции“Разрешить добавлять соисполнителей к работам, не являющихся\nподчиненными”в качестве соисполнителя можно выбрать неподчиненных\nсотрудников. При этом работа «Запрос на участие..» приходит каждому\nнеподчиненному исполнителю. В случае, если и ответственный и исполнители —\nсотрудники, не находящиеся у пользователя в подчинении, то ответственным за\nкорневую работу является автор работы, пока исполнитель не согласиться\nпринять на исполнение работу. Согласование ответственного и исполнителей\nпроисходит параллельно. В случае, если один из исполнителей отказывается от\nучастия в работе, соответствующая ему дочерняя работа не создается. В\nслучае, если отказывается исполнитель — ответственным за корневую работу\nостается автор.\nВ зависимости от настройки“Ставить работы исполнителям от имени\nответсвенного”(настройка расположена в Конфигураторе) и активного\nполя“Ответственный”постановка работ происходит следующим\nобразом:\nIf the setting is enabled and assignee is entered, works are set to the\nassignee on behalf of the author and to executors on behalf of the assignee.\nIf the setting is disabled and assignee is entered, works are set to the\nassignee and to executors on behalf of the author.\nIndependently of the setting if the assignee is not set, several independent\nworks will be created on behalf of the author to every individual executor.\nДля добавления ответственного/исполнителей за работу, необходимо найти\nсотрудника с помощью поля поиска, либо в разделах выбранные или часто\nвыбираемые, либо выбрать его из дерева организационной структуры, либо\nвыбрать его из дерева групп пользователей (только для исполнителей). Формат\nотображения ФИО пользователей настраивается методологом системы и может быть\nпредставлен в одном из видов - полное (Фамилия Имя Отчество), либо краткое\n(Фамилия И.О.). В списке «Часто выбираемые» отображаются пользователи\nсогласно правам пользователя и выбранного типа маршрута: в случае типа“работа”и при отсутствии иных настроек — только подчинённые\nпользователи; в случае работы типа «Согласование», «Ознакомление» - все\nпользователи, которые попали в список «Часто выбираемые».\nFigure 5.9. User selection window\nAfter the assignee/executor is selected, click \"Select\" button. A user can\nchange a assignee for set work. If this is the case, the current work is\nclosed, and a new one is created replacing it with the same parameters, but\nnew assignee person and new beginning date (the current date).\nПри создании новой работы, вводимое значение нагрузки обозначает количество\nвремени, затрачиваемое на выполнение работы в один день. Методологом\nсистемы, при создании категории, вводится норма нагрузки - это количество\nчасов, необходимое для выполнения всей работы. Значение может быть введено\nотносительно длительности рабочего дня (в процентах)  или абсолютным\nзначением (количество часов). Т.е. если норма нагрузки согласно категории\nработы - 8 часов, длительность работы - 2 дня, длительность рабочего дня 8\nчасов, то занятость будет составлять 50%, если ввести значение нагрузки 8\nчасов в день при длительности рабочего дня 8 часов, то занятость независимо\nот длительности работы будет составлять 100%.\nIn work adding window \"Keywords\" field can be filled to search works in the\nfuture. Keywords are entered separated by \"Enter\".\nAlso a user can fill in \"Comments to work\" field; comments are shown in\nadditional information panel in \"Comments\" field.\nBelow in the work adding window documents related to the work can be\nattached. For works with documents attached, a folder is created, the author\nand the assignee persons have full access rights to the folder and files to\nit can be added in two ways:\nfrom computer (without adding to the System storage);\nfrom the storage (adds a link to an existing file from a folder in the\nStorage).\nКогда все параметры новой работы заданы, необходимо нажать на кнопку\n«Сохранить». Только что созданная работа отобразится вверху списка в Потоках\nработ вне зависимости от сортировки.\nFigure 5.10. Новая работа в Потоках работ\nDocuments can be attached to work after its creation by clicking \"+\" button\non the right panel in \"Files\" section. The files can be attached to\n\"Appendices\" and \"Others\" folder. A user can copy a file, upload a new one,\ncreate a text document, and scan a document. Number of attached files is\nshown in counter next to the section name.\nПримечание.\nВ качестве названий файлов разрешено использовать буквы, цифры (0-9),\nсимволы \" \" (пробел),.(точка),-(дефис),№,(,),$,;,^,#,!,_(подчеркивание).\nВсе остальные символы при загрузке заменяются символом“_”(подчеркивание). К данным символам относятся,(запятая),:,?,*,+,&,\\,/,|,''(одиночные кавычки),\"\"(двойные кавычки),%,<,>,{,},[,],=,@,\n`(апостроф) и др.\nSelector of repetition frequency in creation of repeated work. Work can be\ncreated repeating by week days, by month days and yearly .\nФорма завершения указывается при создании или редактировании работы, а так\nже наследуется при перепоручении. Форма завершения по умолчанию принимает\nзначение“нет”и имеет 4 типа (комментарий, файл, форма и\nдокумент, без подтверждения), настраиваемый методологом в Конфигураторе.\nДля того, чтобы выставить прогресс выполнения работы, нужно кликнуть по\nобласти «Прогресс» и передвинуть слайдер на нужное значение, после чего\nнажать на кнопку «Сохранить» или «Отменить» (см. илл. «Выставление\nпрогресса»).\nFigure 5.11. Setting progress\nВ зависимости от настроек в конфигураторе, прогрессы просматриваются и\nвыставляются либо в процентном (от 0 до 100 %), либо в текстовом варианте\n(Получение, Подготовка, Исполнение, Завершение).\nIf the work execution progress or stage thereof is set, the System saves\nevery date of setting progress both for the whole work and for its separate\nstages. The work execution progress can be set only by the author. Progress\nset by the performer is also saved by the System but it is of an informative\ncharacter.\nСтатус предназначен для того, чтобы согласовать/утвердить/ознакомиться с\nработой не открывая сам документ как проект документа. После того, как\nкликнете на кнопку «Ожидание» открывается окно, где нужно подписать\n(согласен/нет) документ.\nПри выполнении действий с большим количеством процессов (например, отправка\nдокумента на согласование большому количеству пользователей) после запуска\nсистема выдает сообщение о факте совершения действия и документу\nприсваивается статус“Обработка”. Работы с таким статусом\nневозможно завершить, удалить, изменить прогресс, так как работа еще не\nсоздана. Также у всех запланированных к запуску процессов в ходе выполнения\nдокумента отображается запись:“Идет обработка…”\nTo complete work, the author ticks checkbox next to work description or set\n100% as work execution progress. If the author sets 100 % of work execution\nprogress, the work is automatically completed and if the work is completed\nwith the current execution per cent, the System asks for confirmation of\nwork completion and a warning that all child works will be also completed is\nshown. Following completion, the work is transferred to \"Completed' filter.\nЕсли при создании работы была указана форма завершения (любая, кроме“без подтверждения”), то при выставлении автором или\nисполнителем 100% прогресса исполнения работы появляется окошко с\nрезультатом работы.\nFigure 5.12. Окно результата работы (тип - «Комментарий»)\nIf type of work completion is \"Comment\" a comment must be entered in the\nopened window.\nFigure 5.13. Окно результата работы (тип - «Файл»)\nIf type of work completion is \"Comment\", there are three possible sources to\nchoose from in the dialog:\nUpload from user computer;\nCopy from the storage;\nSelect from files which are already attached to the work on \"Applications\"\nor \"Other\" dialogs.\nIn the first two cases, a file goes to \"Others\" folder after selection, and\nin the last case new file are not created at all and the pointer to the\nrequired file is clickable link with the name of the selected file.\nЕсли исполнителем был указан комментарий либо файл как результат работы, то\nу автора работы появляется в поле прогресса работы статус , который выводит\nна экран окно результата завершения.\nFigure 5.14. Result confirmation/cancellation window\nAn author can either confirm or cancel result of an executor:\nпри подтверждении результат появится в поле комментарии и будет недоступен\nдля редактирования и выделен соответствующей пиктограммой; результат\nотобразится в ходе выполнения соответствующего документа.\nпри отклонении результата у автора появляется возможность изменить срок,\nуменьшить прогресс выставленный исполнителем(обязательно в меньшую сторону)\nи написать комментарии по поводу отклонения результата работы, который\nзаменит результат испонителя и будет иметь соответствующую пиктограмму.\nПримечание\nIf the work requires confirmation of result, indicator of work result\npresence will be shown only when the result is successfully confirmed. Until\nthen, work progress can be decreased and other result can be entered (for\nexample, change comment or upload another file, decreasing work progress).\nДля создания проекта документа необходимо выделить модуль «Потоки работ» на\nверхней панели нажать кнопку с выпадающим списком рядом с кнопкой «Создать»,\nвыбрать пункт «Проект документа», либо любой другой пункт диалога создания\nпроекта документа. В появившемся окне заполнить нужные поля (краткое\nсодержание, тип, теги), выбрать приоритет, при необходимости прикрепить файл\nс компьютера или из хранилища, указать дату завершения и нажать кнопку\n«Сохранить». Прикрепление файла прямо на этапе создания проекта документа\nпозволяет выбирать загружать ли файл в проект документа или создать\nтекстовый файл HTD. По умолчанию галочка в пункте“Прикрепить\nфайл”отключена, в таком случае будет создан файл HTD.  При активации\nгалочки, активными становятся кнопки“С компьютера”и“Из\nхранилища”, с помощью которых нужно выбрать загружаемый\nфайл. Загружаемый файл будет помещен в папку“Приложения”и\nотмечен как“основной”файл в документе.\nFigure 5.15. Document template creation\nПримечание\nКоличество, а также порядок полей диалога создания проекта документа может\nотличаться в зависимости от выбранного пункта в контекстном меню кнопки“Создать”.\nTo create protocol, click drop-down list next to \"Create\" button on the\nupper panel in \"Work flow\" module and select \"Protocol\" item. In the opened\ndialog fill in the following fields:\nnumber of protocol;\ndate of meeting;\ntheme of meeting;\nselect organizer from organization structure;\nselect secretary from organization structure;\nselect attendants (add users from cards or enter full name and position for\nemployees of other companies);\nkeywords.\nFigure 5.16. Protocol creation\nTo move to the next stage of protocol creation, click \"Next\" button. In the\n\"Resolution\" window fill \"Agenda\" and \"Resolution\" fields. In the\n\"Resolution\" fields, to add resolutions click (+) button; here, works and\ntext items can be edited. For a work specify the following: number and\nwording, select one or more executors and controller, deadline and results.\nFigure 5.17. Adding resolution window\nПосле оформления всех решений, нажать «Далее». На следующем шаге «Маршрут\nутверждения протокола» с помощью кнопки (+)  добавляем новый этап, где нужно\nбудет указать действие (тип: согласование, утверждение и прочие). Далее\nуказать ответственного и уточнить название.\nFigure 5.18. Protocol approval route\nЗаполнив все необходимые поля, нажимаем кнопку «Далее». В открывшемся окне\n«Предпросмотр» можно предварительно посмотреть протокол, также есть\nвозможность сохранить черновик для возможности вернуться и продолжить\nпроцесс оформления протокола. Для запуска маршрута утверждения (если он был\nуказан) или запуска протокольных работ (в противном случае)  нажать кнопку\n«Запустить». В потоках работ на исполнении появляется «Работа по утверждению\nпротокола», как корневая и первый этап маршрута, как дочерний (в случае если\nмаршрут был указан). У ответственного за утверждение в фильтре на исполнении\nпоявляется «Работа по утверждению протокола», после утверждения работа\nзакрывается и создается новое протокольное поручение - у исполнителя решения\nв фильтре на исполнении и на контроле у контролирующего. У председателя\nпротокол отображается в фильтре на исполнении, у секретаря на контроле.\nЕсли был сохранен черновик вернуться к оформлению протокола можно, щелкнув\nправой кнопкой мыши по работе и выбрав в меню пункт «Изменить».\nМетодологом системы могут быть настроены необходимые условия активации\nпротокольных работ: наличие согласования, утверждения, регистрации. На шаге\nмастера «Маршрут утверждения протокола» будет выходить предупреждающее\nсообщение:«Протокол не согласован/утвержден/зарегистрирован», это означает,\nчто протокольные работы будут отправлены исполнителям только после\nвыполнения этих условий. В случае, если в каком-либо шаге мастера создания\nпротокола не заполнено одно или несколько полей- выдается предупреждающее\nсообщение, после чего подсвечиваются незаполненные поля.\nДля создания проекта документа по шаблону необходимо в модуле «Потоки работ»\nна верхней панели нажать кнопку с выпадающим списком рядом с кнопкой\n«Создать», выбрать пункт «Проект документа по шаблону», либо любой другой\nпункт диалога создания проекта документа по шаблону. Использование шаблонов\nдокументов возможно, если в конфигураторе загружены документы, которые будут\nиспользоваться в качестве шаблонов с указанием их типа и срока исполнения и\nформа, созданная в редакторе форм. Документ по форме может отображаться в\nрежиме редактирования или в режиме чтения.\nFigure 5.19. Document project using template\nВ появившемся окне указать название документа, выбрать шаблон, указать сроки\nзавершения, приоритет и ключевые слова. Галочка «Создать работу» включена по\nумолчанию. После заполнения всех полей, нажать кнопку «Создать».\nПримечание\nКоличество, а также порядок полей диалога создания проекта документа по\nшаблону может отличаться в зависимости от выбранного пункта в контекстном\nменю кнопки“Создать”.\nTo print documents created using template with form, save changes in the\ndocument by form, exit editing mode and click Print button.\nПользователь имеет возможность в модуле «Настройки» вкладка «Маршруты»\nсоздать типовые маршруты, которыми он пользуется.  Для этого следует нажать\nна кнопку (+), появится первый этап маршрута, необходимо выбрать «Действие»\nиз списка: работа, согласование, утверждение, ознакомление, регистрация,\nмаршрут; указать ответственного, длительность и нагрузку. Часто используемые\nмаршруты можно добавить в список избранных маршрутов (нажатием на значок\n«звездочку»). Для запуска избранного маршрута необходимо выделить модуль\n«Потоки работ», на верхней панели справа нажать кнопку с выпадающим списком\nрядом с кнопкой «Создать», выбрать нужный маршрут. В появившемся шаблоне\nзаполнить все поля, сменить ответственных и по необходимости другие\nпараметры маршрута и нажать на кнопку «Сохранить».\nTo run rarely used routes in the list select \"Other\" item, select a required\nroute, and in the following, actions are the same as for the previous\nparagraph.\nContext menu\nThe context menu of currently selected work flow depending on selected\ndocument or work at the present moment can include the following items:\nПерепоручить…\nПередать…\nНа согласование…\nНа утверждение…\nНа ознакомление…\nИнформация…\nИзменить…\nAdd to group;\nDelete from group;\nDelete;\nИмпортировать в проект…\nПримечание\nНаименование, действие и порядок отображения пунктов могут быть изменены\nметодологом.\nДанный пункт позволяет перепоручить выбранную работу через контекстное меню\nлибо меню“Отправить”документа.  По умолчанию пункт“Перепоручить”отображается у пользователей, имеющих\nподчиненных сотрудников или соответствующие делегированные права.\nДанный пункт позволяет передавать выбранную работу через контекстое меню\nлибо меню“Отправить”документа (пункт доступен только при\nвключении соответствующей опции методологом). Пользователю, передающему\nработу, на выбор доступны все пользователи организационной структуры,\nнезависимо от того, являются ли они его подчиненными или нет.  Передача\nработы осуществляется так: исходная работа для передающего пользователя\nзавершается, а для принимающего создаётся новая работа со всеми параметрами\nисходной.\nВ системе запрещено передавать согласование, утверждение, ознакомление, в\nсвязи с этим пункт“Передать”для данных процессов отсутствует\nв контекстном меню или в меню“Отправить”документа.\nAllows sending selected work to assignee users for agreement/review,\napproval, or review.\nВ диалоге выбора ответственных за согласование, утверждение или ознакомление\nдоступны множественный выбор пользователей, выбор пользователей с помощью\nвыставления галочки“Выбрать всех”, выбор пользователей из\nгрупп, а также выбор группы как атомарного объекта. В данном диалоге в\nнавигаторе есть раздел“Группы пользователей”, по нажатию на\nкоторый группы отображаются в виде дерева с корневым узлом“Все”. По нажатию на корневой узел“Все”в правой\nчасти диалога отображаются группы всех уровней иерархии в виде атомарных\nобъектов. При выборе в дереве какой-либо группы в правой части диалога\nотображаются все пользователи, входящие в эту группу (т.е. пользователи,\nпринадлежащие к группе, и принадлежащие всем ее дочерним группам), при этом\nсами группы в правой части диалога не отображаются.\nFigure 5.20. Диалог выбора пользователя (-ей) при указании ответственных за согласование\nThe item allows a user to send a work by a predefined route or to form a new\naction sequence.\nЗдесь отображается следующая информация:\nName;\nAuthor;\nPriority;\nСроки;\nФорма завершения работы (если в качестве формы завершения выбрано“Нет”- не отображается)\nГиперссылка на мероприятие проекта (если данная работа была создана из\nмодуля“Проекты”);\nОтветственные.\nЗдесь можно изменить параметры работы: название, сроки, ответственных и\nдр. Набор этих параметров зависит от процесса, по которому была создана\nработа:\nРабота - набор параметров, доступных для изменения, такой же, что и в\nдиалоге создания работы по умолчанию.\nСогласование / Утверждение / Ознакомление / Резолюция - в данном случае\nможно изменить только такие параметры:\nName;\nОтвественный;\nСроки;\nНагрузка;\nPriority;\nКлючевые слова.\nТакже нет возможности запуска и изменения маршрута.\nFigure 5.21. Изменение согласования\nUsed to add a work to the group of works or to delete a work from group of\nworks.\nПредназначен для прерывания запущенного маршрута по конкретному\nдокументу. При прерывании маршрута текущие этапы удаляются (в“Ходе\nвыполнения”делается соответствующая запись), будущие этапы\nпрерванного маршрута нигде не отображаются. Если по данному документу\nзапущено несколько маршрутов, то пункт“Прервать маршрут”открывает подменю, где перечислены запущенные маршруты. Пункт“Прервать маршрут”появляется только у пользователей, которые\nзапускали маршрут по данной работе.\nПункт предназначен для удаления работы. При выборе данного пункта в\nпоявившемся предупреждающем окне“Вы действительно хотите удалить\nданную работу?”необходимо нажать“Ок”, в противном\nслучае“Отмена”.\nИз списка работ на исполнении созданную работу можно перемещать в\nопределённый проект с помощью пункта контекстного меню «Импортировать в\nпроект…». В появившемся окне выбрать проект и нажать «Ok».",
    "Document flow management\nIn the work flow list the System allows displaying any work in document mode\nby double clicking its name. In the mode a user can view history of document\nchanges, its execution progress, edit card of document, stamp resolution and\ndigital signature on document (hereinafter referred to as the DS), set it\nfor approval, agreement, review, and registration, also all attached\nappendices can be viewed. Work opened in document mode is shown below.\nFigure 5.22. Work displayed as document\nOn the left \"Information\" panel the following content is shown:\nCard;\nFiles;\nКнопка“Подписать”;\nКнопка“Завершить”;\nКнопка“Отправить”;\nКарточка позволяет просмотреть регистрационно-контрольную карточку(РКК), ход\nвыполнения и другие изменения в документе. В РКК пользователь может\nпросмотреть информацию по документу которая вводилась при создании\nдокумента. Также пользователь может просмотреть историю исполнения данного\nдокумента во вкладке«Ход выполнения»в карточке\nдокумента. В данной вкладке можно посмотреть список пользователей, которым\nдокумент отправлен на согласование, утверждение, ознакомление либо на\nрегистрацию и время исполнения документа, причем они отображаются\nобязательно в порядке, заданном при их создании. При включении настройки в\nКонфигураторе“Отображать в Ходе исполнения будущие этапы”Система позволяет пользователям, ответственным за этапы маршрута при\nполучении данного документа просмотреть все следующие за данным этапы — они\nбудут отображены в общем ходе исполнения и выделены серым цветом. Во вкладке\n«Изменения в документе» фиксируются все изменения РКК документа (от момента\nсоздания документа до его регистрации в журнале), а также отображаются\nизменения внесенные в процессе разработки документа, то есть информация о\nпользователе, который ввел изменения, дата изменения, IP пользователя,\nописание и комментарий. Также в этой вкладке отображается все изменения,\nсвязанные с этим документом:\ncreating document.\nadd/change (upload new version, changing HTD file)/deletion file from\ndocument folder.\nregistrying document.\ninformation on who completed work.\ninformation on resolution.\nchanging RCC.\nВ карточке документа появляются вкладки«Лист\nсогласования»и«Лист подписей», если\nдокумент уже согласован/утвержден и подписан. В листе согласования\nотображается список пользователей, которые согласовали документ. В листе\nподписей отображается список пользователей, которые подписали документ с\nотображением вида подписи:\n“ЭЦП”- для подписи с электронно-цифровым ключом;\n“Обычная”- для подписи без ЭЦП.\nПроверка электронно-цифровой подписи документа может быть инициирован любым\nпользователем из карточки документа, путем нажатия в листе подписей кнопки“Проверить ЭЦП”.  Проверка осуществляется для каждой подписи на\nдокументе и по ее окончании отображается окно, содержащее результат\nпроверки: подпись верна (зеленый цвет), подпись просрочена (желтый цвет),\nподпись неверна (красный цвет).\nUsing\"Print\"button a user can print out the full\ndocument card (RCC, Execution history, Document changes), RCC, Work progress\nhistory, Document changes, lists of agreement, approval and signatures if\nthere are any. Every printed page has QR code with the following\ninformation: server address, name of user account, date and time of\nprinting, and ID of document.\nFigure 5.23. Document card\nПри получении документа в качестве работы, а также при открытии документа в\nхранилище Система предоставляет возможность создать новый документ\n(дочерний) на основе полученного документа. Для этого необходимо открыть\nполученный из журнала документ (работу), и нажать на кнопку в верхнем левом\nуглу«Создать дочерний документ»(см.илл. «Создание\nдочернего документа»), в открывшемся окне указать краткое его содержание и\nтип документа, нажать кнопку «Сохранить». В карточке документа появится\nвкладка«Дочерние документы», где можно просмотреть\nсписок дочерних документов и краткую информацию по ним: автор, номер,\nкраткое содержание и тип документа, а также дату регистрации (без времени).\nFigure 5.24. Affilated document creation\nTo view attachments to work there are \"Attachments\" and \"Other\" folders in\n\"Files\" section.\nFigure 5.25. Attachments\nAccordingly, to attach additional files which are parts of the main document\nfile to a document use \"Appendices\" block and to attach auxiliary files\nwhich are not part of the document, but are required to develop and/or to\nunderstand essence of the document use \"Other\" block. A user can attach\ndocuments of any formats including text formats. In order to do so, click\n\"+\" button in the corresponding block and select a required menu item in the\ndrop-down list:\n\"From storage\" item allows inserting link to a document from storage;\n\"From computer\" item allows uploading document from computer;\n\"Create new\" item allows creating and adding to the work a text\ndocument. Created text document can be opened by double-clicking and edited.\nПункт «Сканировать» позволяет сканировать документ через пользовательский\nагент Synergy и прикрепить его к работе.\nПримечание.\nДля того, чтобы воспользоваться функцией сканирования документов, необходимо\nустановить и запустить пользовательский агент Synergy. Как его установить,\nсм. подробнее в разделе“Руководство по установке\nагента Synergy”.\nFigure 5.26. Сканирование документа в пользовательском агенте\nFigure 5.27. Окно сохранения отсканированного документа\nDocument scan window has the following functions:\ndocument page scan;\ndocument page rotation;\nchange of order за document pages;\ncreate PDF version of documents from separate images;\nsaving PDF version and images to storage.\nIf context menu of attached file is called (file name is bold), the\nfollowing items are available:\nСкачать (документ загружается на компьютер);\nСкачать PDF версию (pdf версия документа загружается на компьютер);\nСделать основным (документ становится основным-выделяется подчеркнутым);\nНовая версия (позволяет загрузить новую версию документа);\nУдалить (документ удаляется).\nПримечание\nЗапрещено добавлять новую версию либо удалять основной файл по форме записи\nреестра (файл по форме, который добавляется при создании реестра и\nсоответствует форме, которая указана в настройках реестра). Поэтому при\nвыборе пункта“Новая версия”контекстного меню основного файла\nпо форме записи реестра система возвращает ошибку:\nНевозможно добавить новую версию для основного\nфайла по форме\nПри выборе пункта“Удалить”для данного файла система\nвозвращает ошибку:\nНевозможно удалить основной файл по форме\nДокумент (основной файл) можно распечатать, скачать и отредактировать с\nпомощью соответствующих кнопок в правом верхнем углу панели. Также можно\nскачивать, изменять (т.е. удалять и добавлять) приложения, прочие файлы и\nссылки к основному документу. Для того, чтобы отредактировать проект\nдокумента, необходимо его развернуть, в блоке «Приложения» выбрать основной\nфайл документа и нажать кнопку редактирования в правом верхнем углу . В\nслучае, если документ находится на согласовании/рассмотрении, утверждении,\nознакомлении, а также зарегистрирован в канцелярии, функция редактирования\nне доступна.\nЛюбой пользователь может подписать текущую версию документа после получения\nего на исполнение. Для этого служит кнопка«Подписать»на нижней панели. Для постановки подписи должен использоваться ключ ЭЦП. Но\nв случае, если в организации не используется ЭЦП, то факт подписи просто\nфиксируется в метаданных с сохранением хеша подписываемых документов.\nДля подписания документа с использованием ЭЦП необходимо активировать\nгалочку“Использовать ЭЦП”, и в окне подписания появится\nвозможность выбора программы через которую требуется подписание.\nFigure 5.28. Выбор варианта подписания документа\nПодписание через Synergy Agent\nПри выборе варианта“Использовать Synergy Agent”отобразится\nинформация о настроенной ЭЦП. По нажатию на кнопку“Обновить”, система обновляет информацию о\nнастроенной ЭЦП/настройке клиента Synergy. По нажатию пользователем на\nкнопку“Подписать”осуществляется подпись,\nинформация о подписи автоматически добавляется в таблицы“Лист\nподписей”и“Проверка ЭЦП”в карточке документа.\nПримечание.\nДля того, чтобы воспользоваться функцией подписания с использованием ЭЦП\nнеобходимо установить и запустить пользовательский агент Synergy. Как его\nустановить, см.  подробнее в разделе“Руководство\nпо установке агента Synergy”.\nТакже необходимо указать контейнер ключей и сертификатов, который будет\nиспользоваться при подписании. Для этого необходимо в контекстном меню\nиконки пользовательского агента Synergy в системном лотке выбрать пункт“Выбрать ключ”и в открывшемся окне указать путь к контейнеру.\nДалее в списке“Алиас”необходимо указать добавленный ключ,\nввести пароль, и нажать на кнопку“Выбрать ключ”.\nFigure 5.29. Подписание документа с ЭЦП в пользовательском агенте\nВ случае возникновения ошибок в окне“Подписать”будет\nотображаться текст с описанием ошибки, а также кнопка“Подписать”становится неактивной.\nFigure 5.30. Ошибка при подписании с ЭЦП в пользовательском агенте\nЕсли пользователю документ отправлен для согласования, утверждения или\nознакомления, то подписание документа доступно в диалоге\nсогласования/утверждения/ознакомления, куда можно добавить еще и текстовый\nкомментарий.\nFigure 5.31. Agreement with signature\nПри согласовании / рассмотрении либо утверждении документа с использованием\nцифровой подписи, после нажатия соответствующей кнопки\n(«Согласовать/Рассмотреть» либо «Утвердить») в\nоткрывшемся окне нужно активировать галочку «Использовать ЭЦП» и отобразится\nинформация о настроенной ЭЦП (см. илл. «Согласование с цифровой подписью»).\nFigure 5.32. Agreement with digital signature\nПодписание через NCALayer\nПри выборе варианта“Использовать NCALayer”отобразится окно\nвыбора ЭЦП из системы в случае если запущена программа NCALayer и установлен\nмодуль Arta Synergy.\nFigure 5.33. Выбор ЭЦП\nПо нажатию пользователем на кнопку“Подписать”осуществляется подпись,\nинформация о подписи автоматически добавляется в таблицы“Лист\nподписей”и“Проверка ЭЦП”в карточке документа.\nПримечание.\nДля того, чтобы воспользоваться функцией подписания с использованием ЭЦП\nнеобходимо установить и запустить программу NCALayer. Установить модуль Arta\nSynergy. Как его установить, см. подробнее в разделе“Модуль для NCALayer”.\nВ случае если не запущена программа NCALayer, то в окне подписания появится\nтекст“NCALayer не запущен. Запустите NCALayer и повторите\nпопытку.”\nFigure 5.34. Ошибка доступности NCALayer\nВ случае если не установлен модуль Arta Synergy в программе NCALayer, то\nпоявится текст“Не установлен модуль Arta Synergy. Установите модуль и\nповторите попытку.”\nFigure 5.35. Ошибка доступности модуля Arta Synergy\nВ случае если не выбран ключ ЭЦП, то появится текст“Не выбран ключ\nдля подписания. Выберите ключ и повторите попытку.”\nFigure 5.36. Не выбран ключ ЭЦП\nСистема позволяет перепоручить исполнение документа либо каких-либо работ\nсвязанных с документом, другому пользователю вниз по иерархии орг.структуры\n(подчинённому). По нажатию кнопки«Завершить»на панели\nдокумент считается исполненным.\nAll document projects which a user has ever worked with (created, approved,\nagreed) can be found in \"My\" branch of \"Documents\" module (\"Storage\"\nsection).\nTo make decision on document, the System has function to create a resolution\nfor a document. A resolution can be created by:\nРуководитель подразделения (согласно настройке“Количество уровней\nоргструктуры с правом на создание резолюции”), а также его\nзаместители;\nUsers who have been delegated rights to create works .\nПо умолчанию резолюцию могут накладывать руководители всех подразделений, у\nкоторых есть подчиненные.\nПримечание\nДля внесения ограничения на создание резолюции обратитесь к методологу.\nВ зависимости от настройки“Не удалять работу, на которую была\nналожена резолюция”(настройка расположена в Конфигураторе) создание\nдополнительной резолюции происходит следующим образом:\nесли настройка выключена и дополнительную резолюцию накладывает исполнитель\nпункта уже имеющейся резолюции, то в ходе выполнения документа удаляется\nветка работ данного пользователя и в отдельной ветке создаются новые работы\nпо вновь принятой резолюции. Перед тем как удалить дочерние работы, система\nвыдает предупреждающее сообщение“Наложение дополнительной резолюции\nприведет к удалению Ваших работ с дочерними работами. Вы действительно\nхотите это сделать?”, по нажатию на“Ок”, действие\nвыполняется, в противном случае пользователь возвращается к окну\nредактирования резолюции.\nесли настройка выключена и дополнительную резолюцию накладывает\nответственный пункта уже имеющейся резолюции, то в ходе выполнения документа\nудаляется вся ветка работ по всему пункту резолюции, в которой данный\nпользователь является ответственным, в отдельной же ветке создаются новые\nработы по вновь принятой резолюции.\nесли настройка включена, то при наложении дополнительной резолюции данная\nрезолюция запускается в подпроцессе и работа, на которую накладывают\nрезолюцию, становится корневой работой по резолюции.\nДля создания резолюции необходимо нажать кнопку«Резолюция»и в открывшемся окне ввести как минимум\nодно поручение:\nФормулировка (обязательно поле);\nОтветственный (обязательное поле для включенного флажка);\nСроки (обязательное поле);\nТип (по умолчанию тип“Работа”);\nРезультат работы (по умолчанию-“нет”)\nИсполнители (обязательное поле для выключенного флажка).\nFigure 5.37. Наложение резолюции\nПоля“Ответственный”(с включенным флажком) и“Исполнители”по умолчанию пустые. Для внесения в пункт\nрезолюции только исполнителей, нужно выключить флажок рядом с полем“Ответственный”(поле станет недоступным).  При это поле\nотображает всех выбранных пользователей, увеличиваясь по вертикали. Для\nдобавления нового пункта, необходимо нажать кнопку“Добавить\nпункт”и заполнить обязательные поля. Здесь же можно указать, что\nдокумент является контрольным, поставив галочку в пункте“Является\nконтрольным”. Для удаления пункта резолюции, необходимо нажать на\nкнопку удалить (корзина). При работе с резолюцией доступны кнопки «Принять»,\n«Сохранить». Для наложения резолюции необходимо нажать кнопку\n«Принять». Если резолюция была сохранена, то при повторном открытии окна,\nсохраненные данные отобразятся. В списке потоков работ документы с\nрезолюцией отмечаются значком наличия резолюции в порядке следования\nсозданных пунктов. Вид документа с резолюцией приведен ниже:\nFigure 5.38. Resolution\nВ зависимости от настройки“Ставить работы исполнителям от имени\nответственного”(настройка расположена в Конфигураторе) и активного\nполя“Ответственный”постановка работ по резолюции происходит\nследующим образом:\nIf setting is on and a assignee is indicated, the root work on the\nresolution of the assignee is set on behalf of the author, to the executor\non behalf of assignee.\nIf setting is off and a assignee is indicated, the root work on the\nresolution to the assignee and to the executors is set on behalf of the\nauthor.\nIndependently of setting and of absence of assignee, the root work on the\nresolution to the executors is set on behalf of the author.\nПримечание\nFor text content of resolutions a user can set an arbitrary template\n(customized in the Configurator).\nIn order to print the selected document without resolution, with resolution,\nand separately resolution, click \"Print document\" button.\nДля пересылки, перепоручения и отправления документа (проекта) на\nсогласование/рассмотрение, утверждение, ознакомление, регистрацию служит\nкнопка«Отправить». Работа, отправленная как документ\n(функция“Переслать”), отображается у получателя в разделе“Документы”модуля“Хранилище”. Также с помощью\nэтой кнопки можно отправить документ как служебную записку, по заданному\nмаршруту (пункт меню «По маршруту…»). При выборе пункта меню «По маршруту…»\nв открывшемся диалоге предоставляется выпадающий список всех сохраненных в\nСистеме маршрутов (без необходимости добавления их в список избранных в\nпользовательских настройках). При отправлении документа по процессу\nрезолюции создастся работа, в которой пользователю будет доступно только\nналожение резолюции либо завершение работы (будет отсутстовать возможность\nотправки документа на согласование, утверждение, ознакомление и т.п.). При\nвыборе пункта меню «В хранилище» в открывшемся окне выбора файлов документа,\nследует указать с помощью галочки нужные файлы и нажать кнопку «Далее» для\nвыбора папки, после выбора нажать кнопку «Принять».",
    "Work reports\nWork flows has several types of report. In order to generate a report, click\nthe button with printer icon. Then, menu to select type of report is shown.\nFigure 5.39. Work report forming menu\nSelected group works\nAllows generating a report on the work related to a project or group of\nworks. To do so, click on a work in the group of interest, and then click\n\"Work of the selected group\" item. The generated report contains comments,\ntiming, progress and current status of the execution of works in selected\ngroup.\nFigure 5.40. Report on selected group works\nSelected group works (rtf)\nThe menu item exports report on selected group works as rtf format.\nSelected group works (xls)\nThe menu item exports report on selected group works as Excel format.",
    "Chapter 6. \"Daily planner\" module\nРевизия VCS: 3c3e04345\nДата сборки документа: \n\t\t\t\t\t2023.11.09 17:03:53\nTable of Contents\nUsers' work with \"Daily planner\" module\n\"Daily planner\" module is designed:\nto plan assignments with duration of less than one day;\nto call workers for a meeting;\nto control working day of subordinates.\nMain actions in \"Daily planner\" module:\nviewing daily planner in day/week/month mode;\ncreating notes during a day;\nforming report.\nFigure 6.1. \"Daily planner\" module\nНа иконке модуля ежедневник в кружочке Система уведомяет о количестве новых\nсобытий (новые заметки от руководителя, заметки-совещания,\nзаметки-оповещения и др.). Также при появлении новых событий браузер мигает\nс заголовком“NEW!”.  Мигание браузера по желанию может быть\nотключено в пользовательских настройках.\nВ навигаторе отражается текущая дата, календарь для передвижения в\nежедневнике по времени и кнопка обновления ежедневника. Ниже навигатора\nрасположена панель для заметок. Для создания заметки нужно нажать кнопку «+»\nв поле заметок и ввести текст заметки.  Изменения в заметках автоматически\nсохраняются при изменении поля фокуса ввода, также при переходе в другой\nмодуль и других действиях. При перетаскивании заметки в область выбранного\nдня ежедневника, она становится заметкой с параметром в течение дня.\nThe panel just above the daily planner displays buttons to switch display\nmodes (Day, Week, Month) and button to print report on daily planner data\n(printer icon).\nКнопка «+» в основной рабочей области предназначена для создания новой\nзаметки в ежедневнике. Она вызывает новое окно, где непосредственно\nуказываются все параметры заметки (см. илл.  «Создание новой заметки»).\nFigure 6.2. Создание новой заметки\nThe form has the following elements:\nNote description;\nCheckbox setting dependence of note on time;\nTiming change fields. These fields are not active when checkbox to set\ndependence on time is not checked. In this case, a note will be created to\nperform throughout the whole day;\nCalendar to select date;\nСредство выбора частоты повторения при создании повторяющейся\nзаметки. Повторяющаяся заметка может быть создана с повторением по дням\nнедели, по дням месяца либо ежегодно. При выборе любого варианта (кроме -“Нет”), значение дня, из которого вызван диалог создания\nзаметки, по умолчанию вставляется в появляющееся поле.\nПрикрепление файла. Предоставляет возможность добавлять файлы к заметке с\nкомпьютера пользователя или из хранилища/моих документов.\nChecked, sets the properties of notes \"Personal\". In this case, the note is\nshown in light blue, and is not available for superiors to view;\nГалочка, устанавливающая свойство заметки «Совещание» при планировании\nсовещания. При этом в окне создания заметки открывается список возможных\nучастников и предоставлена возможность добавить/удалить участников в этот\nсписок без учета организационной структуры;\nNote save button.\nA note can be edited with double click on note. If date is changed, the note\nis transferred to another day in the  daily planner.\nЕжедневник может быть отображен в трёх видах представления: день, неделя и\nмесяц (см. илл. «Представление ежедневника в режиме «День»»,\nилл. «Представление ежедневника в режиме «Неделя»», илл.  «Представление\nежедневника в режиме «Месяц»»).\nFigure 6.3. Daily planner appearance in \"Day\" display mode\nFigure 6.4. Daily planner appearance in \"Week\" display mode\nFigure 6.5. Daily planner appearance in \"Month\" display mode\nTo switch between \"day\" and \"week\" views, click either on button on the top\npanel or on heading with day name.\nTo view daily planner in \"month\" mode perform actions similar to switching\nto other modes.\nДля формирования отчёта существует кнопка «Отчёты» (кнопка с изображением\nпринтера), которая открывает окно выбора параметров печати (см. илл. «Окно\nформирования отчёта по ежедневнику»).\nFigure 6.6. Window to form daily planner report\nThere are four options: \"Current Month\", \"Last Month\", \"This Week\" and\n\"arbitrary period\" for selecting the reporting period. \"Current Month\" means\nthat time period will be selected from the first day to the last day of the\ncurrent month, and \"Last month\" option is selected the period will be from\nthe current day of the current month to the same day of the previous month.\nТип отображения «список» представит отчёт в виде списка следующего\nсодержания (см. илл. «Отчёт по ежедневнику в режиме «список»»).\nFigure 6.7. Daily planner report in \"list\" mode\nТип отображения «сетка» представит отчёт в виде таблицы следующего\nсодержания (см. илл. «Отчёт по ежедневнику в режиме «сетка»»).\nFigure 6.8. Daily planner report in \"table\" mode",
    "Chapter 7. \"Storage\" module\nРевизия VCS: 3c3e04345\nДата сборки документа: \n\t\t\t\t\t2023.11.09 17:03:53\nTable of Contents\nThe module includes three main sections:\nFiles section is designed to upload, view, and search in text, video, audio,\nand graphic files.\nRegistries are designed to display structured information on basis of forms.\n\"Documents\" section automates registration of incoming, outgoing, and\ninternal documents; also allows sending and reception of emails, grouping\nthe registered documents in dossiers and storing them according to\nnomenclature of dossiers.\nFiles\nThis section allows storing personal documents on the server. Left side of\nnavigator displays personal documents folder of a user (My Documents), where\nhe or she can create directory structure, add, edit and delete folders and\ndocuments as a user thinks proper. Search personal documents by entering\ndocument title in the search bar on the top panel.\nFigure 7.1. My documents\nAlso navigator area shows folder to store and work with the corporate\ninformation in files of any format. A user can create bookmark to the\ncurrent folder by clicking \"star\" button in the upper right corner. After\nthat the folder is listed in the \"Favourites\" folder. Navigation pane shows\nrepository structure as a hierarchy of folders.\nFigure 7.2. Files\nCreate folder\nTo create a folder, select a folder where the created folder will be located\nin and a user has access to, click \"Create\" button and select \"Create\nfolder\" item.\nIn the opened dialog (see Fig. 7.1.1.3. Creating folders in files section)\nenter folder name.\nFigure 7.3. Creating folder in Files section\nПосле чего нажать кнопку «Готово». Созданная папка появится в дереве ваших\nпапок. Таким образом, можно создавать как папки, так и вложенные папки. Если\nвыделить корневую папку, то справа в рабочей области отобразится ее\nсодержимое: папки и документы.  Вложенные папки можно переименовывать. Для\nэтого необходимо выделить корневую папку, в правой части окна по нужной\nпапке щелкнуть правой кнопкой мыши и в контекстном меню выбрать пункт\n«Переименовать». В появившемся окне вместо старого названия папки ввести\nновое и нажать кнопку «Готово». В контекстном меню присутствует пункт\n«Переместить», при помощи которого можно поменять местоположение\nпапки. Удалить папку можно, вызвав соответствующий пункт контекстного меню.\nLoad document\nДля добавления документа в нужную папку, необходимо выделить папку и нажать\nкнопку «Создать» и выбрать пункт «Загрузить документ». В появившемся окне\nвыбрать файл, который вы хотите добавить. После выбора файла в поле\n«Название документа» появится имя документа.\nFigure 7.4. Loading document\nНажав кнопку «Далее» вы можете проверить введенные вами данные, и если на\nэтом вы решили, что никаких других дополнительных сведений о файле вы\nвносить не будете, то достаточно нажать кнопку «Готово» и файл добавится в\nсписок.\nФайл можно загрузить не только с помощью пункта меню, но и перетащив\nнеобходимый файл (или несколько файлов) в область со списком файлов в режиме\nотображения «Таблица». При этом в дочерние папки загрузка невозможна.\nCreate new document\nДля создания нового документа в папке, необходимо ее выделить и нажать\nкнопку «Создать» и выбрать пункт «Создать новый документ». В появившемся\nокне дать название документу.\nFigure 7.5. Creating new document\nПримечание.\nВ качестве названий файлов разрешено использовать буквы, цифры (0-9),\nсимволы \" \" (пробел),.(точка),-(дефис),№,(,),$,;,^,#,!,_(подчеркивание).\nВсе остальные символы при загрузке заменяются символом“_”(подчеркивание). К данным символам относятся,(запятая),:,?,*,+,&,\\,/,|,''(одиночные кавычки),\"\"(двойные кавычки),%,<,>,{,},[,],=,@,\n`(апостроф) и др.\nBy clicking \"Apply\" button, text editor opens where a user can enter\nrequired text.\nFigure 7.6. Text editor\nAdding additional data about document\nTo add more details about the document when the document is loaded, click\n\"Next\" button to open a window where a user can enter document metadata\n(more information about the document, which can be used in searching or\nsorting documents) or in the preview window of the document by clicking\n\"Properties\" button, if a user has appropriate rights, the user can edit\ninformation about the document.\nFigure 7.7. Window for entering document metadata\nFollowing entering metadata, click \"Next\" button to select categories of\ndocument, i.e. to which categories the file will be uploaded.\nFigure 7.8. Document category selection window\nКнопка «Назад» позволяет вернуться назад и что-то изменить.  Кнопка «Далее»\nдает возможность проверить введенные данные.\nКнопка «Готово» сохраняет документ, после чего он появляется в списке\nдокументов. Таким образом, можно добавлять различные виды документов, в\nразные папки, как в ваши личные, так и в общие, доступные всем.\nTo view and change meta data of documents (category, version and other\nproperties) click corresponding buttons in the document view window.\nDocument view\nOpen document for viewing by double click.\nFigure 7.9. Document view\nНа правой боковой панели есть возможность просмотра документа по странично,\nувеличение или уменьшение масштаба просмотра, а также можно скачать\nдокумент. При необходимости можно убрать панель.  Система позволяет\nпросматривать текстовые файлы форматов: doc, docx, xls, xlsx, odt, odp, pdf,\nrtf, ppt, dwg; мультимедийные файлы форматов: mp3, avi; изображений\nформатов: png, jpg; чертежи форматов: tiff, dwg.\nFigure 7.10. TIFF file viewing\nAll TIFF format files can be viewed by a special viewer which:\nopens only part which suits window dimensions - default viewing region is\nleft top corner of page;\nis able to move document page using mini map of page - by moving element\nshowing viewing region on a page miniature;\nis able to change viewing region of document page by dragging and moving\nwith hand tool;\nis able to change scale of viewing document page by selecting it from list:\n10%, 25%, 50%, 100%, 150%. Default scale is 100%;\nis able to navigate to the next and previous pages of documents (if they are\npresent) without miniature use;\nis able to print out currently viewing region as a separate image.\nПо умолчанию состояние мини-карта - скрыта. Для того чтобы восстановить\nмини-карту нужно нажать кнопку .\nЕсли в пользовательских настройках включен альтернативный просмотр\nдокументов, то экран просмотра будет выглядеть следующим образом:\nFigure 7.11. Альтернативный просмотр документа\nВ таком режиме просмотра доступны следующие функции:\nотображение боковой панели с режимами просмотра миниатюр либо содержания\n(при наличии)\nпоиск по документу\nпостраничный переход\nразличные варианты масшиабирования\nповороты по/против часовой стрелки\nотправка на печать\nзагрузка\nинструменты по переходу на первую/последнюю страницу, включению инструмента“Рука”и просмотру свойств документа\nEditing, scanning and other actions in Files section\nFiles section has function to edit document using context menu, which\nincludes the following actions:\nCreate project (document project);\nCreate shortcut;\nUpload new version;\nRename;\nMove;\nDownload;\nDownload as PDF;\nDelete;\nSend by e-mail;\nСканировать документ.\nIf several files are selected, an operation can be performed on the selected\nfiles. If you download a group of files, the archive with them is\ndownloaded.\nIf an user disabled e-mail, \"Send by e-mail\" item is hidden.\nДля сканирования документов необходимо выбрать из выпадающего списка\nконтекстного меню пункт «Сканировать документ». Процесс сканирования\nаналогичен таковому впотоках работ(см. илл. «Сканирование документа в пользовательском агенте»).\nDescription of text editor instrument panel\nFigure 7.12. Text editor\n-cохранение документа, -сохранение версии;\nизменение шрифта,-изменение размера\nшрифта;\nвыделение выбранного фрагмента жирным начертанием\nSelect with cursor a segment of text which should be bold and click the\ncontrol button. To delete bold formatting, select the fragment and click the\ncontrol button;\n-выделение выбранного фрагмента курсивным начертанием\nSelect with cursor a segment of text which should be italic and click the\ncontrol button. To delete italic formatting, select the fragment and click\nthe control button;\n-выделение выбранного фрагмента подчёркиванием\nSelect with cursor a segment of text which should be underlined and click\nthe control button. To delete underline formatting, select the fragment and\nclick the control button;\nвыделение выбранного фрагмента зачёркиванием\nSelect with cursor a segment of text which should be stricken out and click\nthe control button. To delete stricken formatting, select the fragment and\nclick the control button;\n-выравнивание текста по левому краю\nTo align text by left side, select the paragraph and click the button;\n-выравнивание текста по центру\nTo align text by center, select the paragraph and click the button;\n-выравнивание текста по ширине\nTo justify text, select the paragraph and click the button;\n-выравнивание текста по правому краю\nTo align text by right side, select the paragraph and click the button;\n-изменение цвета текста, -изменение цвета\nфона\n-создание нумерованного списка\nAn ordered list can be created in two ways:\nВыбрать этот элемент управления и просто набирать названия пунктов, отделяя\nих переходом на новую строку\nСначала написать список, помещая каждый новый пункт на отдельной\nстроке. Затем необходимо выдеить его мышью и выбрать данный элемент\nуправления\nTo delete numbering, select all list and click the button.\n-создание маркированного списка\nAn unordered list can be created in two ways:\nВыбрать этот элемент управления и просто набирать названия пунктов, отделяя\nих переходом на новую строку\nСначала написать список, помещая каждый новый пункт на отдельной\nстроке. Затем необходимо выделить его мышью и выбрать данный элемент\nуправления\nTo delete unordered list, select all list and click the button.\n-увеличение отступа абзаца от левой границы\nTo increase left paragraph indentation place mouse cursor at any position of\nthe paragraph and click the button several times until the text is intended\nas desired.\n-уменьшение отступа абзаца от левой границы\nTo decrease left paragraph indentation place mouse cursor at any position of\nthe paragraph and click the button several times until the text is intended\nas desired.\n-вставить таблицу,-вставить\nстроку, -вставить колонку сверху,\n-удалить строку, -удалить колонку;\n-вставить ссылку\nText can be made a hyperlink; in order to do so, click button and enter\naddress and text of the link.\n-вставить ссылку на документ\nЕсли вы хотите добавить ссылку на другой документ нажмите на кнопку и в\nоткрывшемся окне в поле“Документы”нажмите на кнопку выбора и\nиз Хранилище выберите нужный файл.\n-ссылка внутри документа\nIf you want to add a link inside document, click button and select an anchor\n(which should be created and saved earlier) in the window.\n-удаление ссылки\nText of a hyperlink can be transformed back to plain text. To do so, select\na hyperlink and click this control button.\n-вставка изображения на страницу\nClick this button to open \"Image properties\" dialog window. If an image is\nnot uploaded to server, select \"Upload\" tab, click \"Find\" button to find the\nimage on computer and click \"Upload to server\" button. After that, select\n\"Image information\" tab and click \"Find on server\" button to select an image\nfrom uploaded ones. If an image is already uploaded and you know its\naddress, insert the address to URL field.\n-установка точки привязки в тексте документа\nAnchor is a bookmark in document text which enables setting a hyperlink not\nonly to a page, but also to a page section. To insert an anchor, place\ncursor to the place and click the button; enter anchor name in the opened\ndialog window.\n-список точек привязок\nOptions in document view window\nBottom panel of the window has buttons \"Discussions\", \"Properties\",\n\"Document classifier\", \"Versions\", \"Links\", \"Copies\".\nFigure 7.13. Options on bottom panel of the window\nЗдесь можно просмотреть темы для обсуждения, ответить на них или добавить\nсвою тему. Для того, чтобы добавить тему, надо нажать иконку «Создать новую\nтему». Появится окно для заполнения новой темы. Здесь нужно ввести название\nтемы, вставить ссылку на документ и сообщение, после чего нажать кнопку «Ок»\nили «Отмена».\nFigure 7.14. New discussion dialog\nThe discussion will be listed in Discussions where users can reply.\nFigure 7.15. List of discussions in Discussions\nTo reply a message of a discussion, another user double clicks the\ndiscussion to open it.\nFigure 7.16. Discussion reply dialog window\nIn the window opened click Reply button. A new message window will\nappear. Enter the message and click \"OK\" button. Your message will be listed\nin the list of messages .\nFigure 7.17. New message dialog window\nЗдесь можно ввести изменения в свойствах документа и обновить метаданные при\nналичии соответствующих прав нажав на кнопки «Сохранить» или «Обновить». А\nтакже в разделе“Ссылки”можно увидеть абсолютную и\nотносительную ссылку на файл.\nFigure 7.18. Document properties\nYou can see categories of the document and change it (if you have required\nrights).\nFigure 7.19. Document classifier\nYou can see date of adding the document, user who added the document, file\nsize and comments. In the window opened you can select any version of the\ndocument and click \"Make current\" button to make a selected version of the\ndocument the current one.\nFigure 7.20. Document versions\nYou can link files to the document by creating links to them here. In adding\nlinks window select a file using selection button, enter description and\nclick \"Save\" button. List of links is shown on the figure below. They can be\nedited and added using corresponding buttons in the left part of the window.\nFigure 7.21. Links\nThe tab allows viewing which projects use original of the document. In the\n\"Work flows\" module click \"Create project\" button to create new work with a\ncopy of the document.\nFigure 7.22. Copies\nFile search\nThe System is able to search document by entering its name in the search\nfield; the document will be searched in all folders of the storage. Enter\nsomething in the search field and press \"Enter\" button to run search\nagain. Enter something in the search field and click \"Search in found\"\nbutton to refine previous query.\nAlso, there is an extended search feature to enter more file search\nparameters.\nFigure 7.23. Extended document search\nVisually, search results window is divided into two parts:\nmain area (center) lists all found text files;\nв дополнительной области (справа) отображаются медиа и др.  файлы.\nЗамечание\nYou can navigate to any other Storage folder from search result window by\nclicking required folder in navigator window, which always shows structure\nof storage folders independently of view regime (file list, search results).",
    "Registries\nРеестры - это структурированный список файлов по определенной форме. Реестры\nсоздаются методологом системы в конфигураторе, и им же разграничиваются\nправа доступа на каждый реестр. Раздел отображается у пользователя только в\nтом случае, если у него имеется право на чтение хотя бы одного реестра. Для\nсоздания новой записи по определенному реестру для начала нужно его выделить\nв навигаторе и нажать кнопку «Создать» либо из выпадающего списка выбрать\nпункт“Новая запись”. Откроется файл по форме в режиме\nредактирования. Заполнив все необходимые поля, нужно сохранить запись. Для\nзапуска записи по маршруту, нужно нажать предпочтительную зеленую кнопку,\nкоторая откроет окно запуска маршрута, где можно отредактировать маршрут\n(редактировать можно только предварительные и последующие этапы маршрута) и\nзапустить его. После чего запись появится в основной рабочей области. Каждая\nзапись реестра имеет статус, отображающий статус процесса: завершено\nуспешно, завершено с ошибкой, в процессе, маршрут не запущен. Согласно\nнастройкам реестра в конфигураторе, запущенные этапы непустого маршрута\nмогут быть созданы как внутри группирующего элемента, который представляет\nсобой обычную работу, так и плоско (т.е. без группирующего элемента).\nFigure 7.24. Registries\nЕсли вам предоставили право на редактирование и изменение записи, то вы\nсможете редактировать не запущенные и активные записи, открыв запись двойным\nкликом левой кнопкой мыши. Если у вас есть право на удаление записи, то при\nвызове контекстного меню записи, будет доступен пункт“Удалить”. При выборе пункта удаления система выдаст\nпредупреждающее сообщение, для подтверждения удаления нажмите“Ок”, в противном случае“Отменить”.\nГруппы реестров\nРеестры можно группировать с помощью групп реестров, которые создаются и\nнастраиваются методологом системы в конфигураторе.  Группы реестров могут\nсодержать внутри себя группы и реестры.  Группа реестров отображается у\nпользователя, если у него имеется право на просмотр хотя бы одного реестра,\nнаходящегося в группе.  Группы реестров отображаются в навигаторе в виде\nдерева. При выборе в навигаторе группы реестров в основной рабочей области\nотображается содержимое группы в таблице: сначала группы, далее реестры. При\nдвойном щелчке по группе пользователь переходит к содержимому выбранной\nгруппы. При двойном щелчке по реестру пользователь переходит к записям\nвыбранного реестра.\nFigure 7.25. Группы реестров\nItem sorting\nТаблица записей реестра по умолчанию отсортированы согласно указанным\nнастройкам в конфигураторе (при этом не по всем полям присутствует\nсортировка). По клику на поле в заголовке таблицы происходит сортировка\nтаблицы по этому полю“по возрастанию”(треугольник\nотображается основанием вниз).  При повторном клике по этому же полю\nнаправление сортировки меняется на“по убыванию”(треугольник\nповорачивается основанием вверх). Также можно отсортировать таблицу по\nстатусу записи реестра. Порядок записей при сортировке по возрастанию\nследующий: не запущенные, в процессе, активные, неудачно\nзавершенные. Порядок записей в столбцах таблицы реестра, содержащих\nкомпонент“Дата/время”либо текстовое поле, которое заполнено\nцифрой осуществляется не по текстовому представлению, а непосредстенно по\nзначению компонента.\nFigure 7.26. Sort items by status (ascending)\nFigure 7.27. Sort items by status (descending)\nФильтрация записей реестров по столбцам\nПо двойному клику на ячейку таблицы, в котором находится заголовок столбца,\nпоявляется поле ввода поисковой строки. После ввода текста и нажатия кнопки“Enter”поризводится фильтрация среди значений выбранного\nстолбца. При этом заголовок столбца принимает следующий вид:\nНазвание поля: Текст, введенный в поисковую строку\nПо нажатию правой кнопкой мыши по ячейки заголовка таблицы открывается\nконтекстное меню с пунктом“Очистить фильтр”. При выборе\nданного пункта фильтрация сбрасывается. Данный пункт активен, только для той\nячейки, по которой произведена фильтрация. Для остальных он отсутствует.\nFigure 7.28. Фильтрация записей по столбцам\nFilters in registries\nВ боковой панели навигатора могут отображаться два вида фильтров:\nцентрализованные, созданные разработчиком Synergy;\nпользовательские, созданные пользователем самостоятельно.\nЦентрализованные фильтры реестров настраиваются в Конфигураторе\nразработчиком Synergy (методологом). Они не имеют контекстного меню: их\nнельзя изменять, удалять или добавлять в них вложенные пользовательские\nфильтры.\nЦентрализованные фильтры используются для разграничения прав доступа к\nотдельным записям реестра для различных групп пользователей.\nПравила определения прав пользователя на запись\nреестра\nДля каждой записи реестра итоговый набор прав пользователя определяется как\nобъединение прав каждого фильтра (в том числе прав самого реестра), если\nодновременно:\nзапись удовлетворяет условиям фильтра;\nпользователь входит в группу, которой установлены права в фильтре.\nПользовательские фильтры работают только с теми записями, которые доступны\nпользователю в корне.\nВне зависимости от установленных прав на реестр и фильтры пользователю\nдоступно право“Редактирование”записей, созданных им лично.\nДля самостоятельной настройки фильтрации записей реестра необходимо добавить\nфильтр и задать одно или несколько условий для полей формы реестра с\nнекоторыми эталонными значениями.  Фильтры создаются при помощи контекстного\nменю навигатора подмодуля“Реестры”. Для реестров доступен\nтолько пункт“Добавить фильтр”, который добавляет фильтр\nпервого уровня.\nДля фильтров реестра доступны следующие пункты:\n“Добавить фильтр”- добавляет новый вложенный фильтр;\n“Редактировать фильтр”- редактирует выделенный фильтр;\n“Удалить фильтр”- удаляет выделенный фильтр.\nПорядок сортировки фильтров, расположенных на одном уровне иерархии в\nдереве, определяется датой их создания. При этом централизованные фильтры\nвсегда расположены выше пользовательских.\nВ условиях фильтрации существуют два способа сравнения:\nЧисловые (“=”,“<”,“>”,“<=”, >=“”,“<>”).\nСтроковые (“совпадает”,“не совпадает”,“содержит”,“не содержит”,“начинается\nс”,“не начинается с”,“заканчивается на”,“не заканчивается на”).\nIf several conditions are added to the filter, rules described in them are\napplied simultaneously (logical \"AND\"). Only components listed in \"Registry\nform fields\", and only of the following types can be used in conditions:\nOne-line input;\nDrop-down list;\nDate/time;\nOptions selector;\nOptions selector;\nСсылка на реестр;\nОбъекты Synergy.\nК примеру, в системе имеется“Реестр сотрудников”(см. илл. «Реестр сотрудников»), где нужно создать фильтр, который будут\nотображать только сотрудников на должности бухгалтера.\nFigure 7.29. Registry of employees\nВыделяем реестр сотрудников и в контекстном меню выбираем пункт“Добавить фильтр”. В фильтре добавляем условие“Должность”содержит“Бухгалтер”.\nFigure 7.30. Creating filter\nВ созданном фильтре отобразятся только пользователи на должности бухгалтера\n(см. илл. «Фильтр бухгалтеров»).\nFigure 7.31. Accountant filter\nФормулировка заметки;\nДля выгрузки данных реестра или фильтра по реестру в файл формата excel,\nнеобходимо выделить нужный реестр/фильтр, нажать кнопку отчеты и из списка\nвыбрать пункт“Выгрузить в Excel”. Если пользовательских\nотчётов для подмодуля не настроено - отчёт «Выгрузить в Excel» вызывается\nсразу же по нажатию на кнопку отчеты.\nFigure 7.32. File to Excel\nSearch in registries\nSearch of information in registries is in the selected registry. The objects\nof search are:\nregistry items;\nfiles of documents of registry;\nattached files to the registry form file.\nFigure 7.33. Search\nSearch results are output broken down by categories according to types of\nobjects found:\nAll results;\nRegistry items;\nFiles attached to items;\nDocument files.\nПоиск производится только по тем записям, которые доступны пользователю\nсогласно настроенным правам на реестр и централизованные фильтры.\nSearch results have additional parameters. If the parameters are changed,\nresults output will be changed according to settings of these additional\nparameters:\nFor registry items:\n\"Item status\" - preparation/active/deleted;\nOption \"Creation date\"; not active by default, values \"From\" and \"To\":\n\"From\" - current date minus 30 days;\n\"To\" - current date.\n\"Activation date\" - date range which includes date of receiving \"active\"\nstatus;\n\"Deletion date\" - date range which includes date of receiving \"deleted\"\nstatus.\nFor files (of both categories):\n\"Item status\" - preparation/active/deleted;\nOption \"Change date\"; not active by default, values \"From\" and \"To\":\n\"From\" - current date minus 30 days;\n\"To\" - current date.\n\"Item activation date\" - date range which includes date when the parent item\nof the file received \"active\" status;\n\"Item deletion date\" - date range which includes date when the parent item\nof the file received \"deleted\" status.",
    "Documents\nThe section automates registration of incoming, outgoing and internal\ndocuments, also has features to send and receive e-mails and registry\ndocuments, to group registered documents in dossiers, and to store them\naccording to nomenclature of dossiers:\nDocument management control;\nUseful document classification;\nQuick multi-parameter search.\nFigure 7.34. \"Documents\" section\nВ разделе «Документы» журналы отображаются только у сотрудников\nканцелярии. Роль «Сотрудник канцелярии» добавляется администратором\nсистемы. Пользователь с данной ролью автоматически получает доступ на чтение\nи запись в журнале. В зависимости от настроек журнала «Сотрудник канцелярии»\nимеет право на отклонение, регистрацию, редактирование документа и\nрезервирование номера в журналах электронной канцелярий. При этом исключена\nвозможность одновременной регистрации одного документа двумя сотрудниками\nканцелярий. Также сотруднику канцелярии доступно редактирование вложенных\nфайлов зарегистрированных документов. Для этого достаточно открыть диалог\nредактирования и добавить туда файлы либо открыть документ для чтения и там\nдобавить нужные файлы.\nDisplayed panels\nПанель позволяет сформировать отчет, просмотреть детали документа, также\nсодержит переключатель между страницами документов. Переключатель доступен\nесли весь список документов не помещается на одну страницу (количество\nдокументов более тридцати). Переключаться между страницами можно тремя\nспособами: переход на следующую/предыдущую страницу, переход на\nпоследнюю/первую страницу, переход на конкретную страницу.\nПримечание\nЕсли весь список документов помещается на одну станицу, переключатель не\nактивен.\nНавигатор содержит следующие элементы: кнопку обновить, журналы документов,\nноменклатуру дел и узел «Все». Часто используемые элементы можно добавить в“Избранное”, включив“звездочку”в пути к нужному\nэлементу. Для удаления закладки нужно выключить“звездочку”либо выбрать пункт контекстного меню“Удалить”и в появившемся\nпредупреждающем сообщении подтвердить действие. По умолчанию в Системе\nсуществует 3 основных вида журналов: входящих, исходящих и внутренних\nдокументов.\nЖурналы.В журналах внутренних и входящих документов,\nпо умолчанию, содержатся следующие фильтры:\n«На регистрации». Здесь находятся документы, ожидающие регистрацию\n(сохраненные черновые записи регистрируемого документа) либо созданные\nсотрудниками канцелярии, подлежащие регистрации (статус документа «На\nрегистрации»).\n\"Execution\". Shows documents which are in work by a user (\"In work\", \"Term\npassing\" document statuses).\n«Просроченные». Сюда попадают документы, срок исполнения которых истёк\n(статус документа «Есть просроченные»).\n\"Completed\".  Shows documents with all works completed (document status\n\"Completed\").\n«На контроле». Здесь отображаются контрольные документы (на плашке\nконрольных документов отображается значок“!”).\nВ журнале исходящих документов, по умолчанию, содержатся фильтры «На\nрегистрации», «Завершенные», «На контроле». Рядом с журналом, фильтром\nжурналов, делом отображается счетчик, указывающий количество документов в\nних.\nДела.В делах отображается общий список номенклатуры\nдел, имеющийся в Системе. Список дел настраивается методологом системы.\nAll.Shows all documents which a user has dealt with at\nany time. This root element has the following subelements:\nMy - documents and e-mail messages created by a user;\nReceived - documents and e-mail messages received by a user;\nОтправленные — документы и почтовые сообщения, отправленные непосредственно\nпользователем.\nДокументы могут быть представлены либо в табличном, либо в строчном\nвиде. Вид отображения документов настраивается внастройках пользователя.\nСодержит список документов в зависимости от выбранного журнала в\nнавигаторе. Ниже списка отображаются детали выделенного документа, в котором\nможно просмотреть РКК, Файлы, Ход выполнения и Изменения в документе (кнопка\n«Детали» раскрывает нижнию панель).\nВ табличном представлении документов (см. илл. «Журнал входящей\nкорреспонденции»), в отличие от строчного представления, доступно изменение\nсортировки прямо в таблице, а не в фильтре. Кроме того, доступна возможность\nотключения отображения некоторых столбцов таблицы, а также изменения их\nпорядка следования. Содержимое подменю пункта“Столбцы”любой\nноды дерева“Журналы”:\nРеестр\nРезолюция\nКонтрольный\nВ прогрессе\nБракованный\nВложения\nНомер\nДата регистрации\nКраткое содержание\nСтатус\nАвтор\nКорреспондент\nКорреспондент (орг)\nЗарегистрировал\nОтписано (по умолчанию)\nНа исполнении\nТочный список зависит от просматриваемого журнала, его типов документов и\nнастроек карточки. Для дел ивсехдокументов этот\nсписок неизменяем.\nДля авторизованного пользователя сохраняются все вышеописанные изменения в\nтаблице, включая изменение ширины столбцов. При этом все измененные\nнастройки таблицы можно вернуть до значений по умолчанию.\nДействия над документами в строчном и табличном представлениях ничем не\nотличаются.\nSearch filter is in the left bottom corner. By clicking arrow next to filter\nname its control elements are shown: list of terms, selection fields, inputs\nfor start and finish dates and their display.\nFigure 7.35. Search filter\nПоиск информации в документах осуществляется как в журналах и делах, так и\nвовсехдокументах.\nFigure 7.36. Search\nПримечание:\nПустой поисковый запрос не возвращает результатов поиска. В таком случае\nотображается надпись“Введите строку для поиска”.\nВыдача результатов поиска разбивается на следующие категории:\nNumber;\nсписок динамически формируемых пунктов;\nНомер (исх);\nКраткое содержание;\nКорреспондент (орг);\nКорреспондент;\nAuthor;\nЗарегистрировал;\nИсполнитель;\nТип документа;\nДоп. поля карточки.\nТочный список зависит от просматриваемого журнала, его типов документов и\nнастроек карточки. Для дел ивсехдокументов этот\nсписок неизменяем.\nВыдача результатов поиска содержит также дополнительные опции.  При\nизменении этих опций результаты поиска будет скорректированы согласно\nсоответствию параметрам этих дополнительных опций:\nСтатус документа\n“Все документы”- зарегистрированные и незарегистрированные\nдокументы;\n“Только незарегистрированные”;\n“Только зарегистрированные”.\nТип совпадения\n“Все”- документы с полным, а также частичным совпадением\nрезультата запроса;\n“Только полное совпадение”- документы с полным совпадением\nрезультата запроса.\nСортировка - определяет сортировку найденных результатов поискового запроса\nПо релевантности (по убыванию);\nПо дате регистрации (по убыванию);\nПо номеру (по возрастанию);\nпо динамически формируемым пунктам (по убыванию);\nПо краткому содержанию (по возрастанию);\nПо автору (по возрастанию);\nПо зарегистрировавшему (по возрастанию);\nПо исполнителю (по возрастанию).\nГруппировка результатов - определяет тип сортировки документов с учетом их\nстатуса\nБез группировки;\nСначала незарегистрированные.\nПользователь может самостоятельно установить опции по умолчанию. Рядом с\nтакими категориями и опциями отображается желтая звезда.\nChancery document logs\nВсе журналы и папки электронной канцелярии отображаются слева в окне\nнавигатора. Новые папки, журналы в электронную канцелярию также добавляются\nметодологом системы по необходимости. Сами документы, содержащиеся в этих\nпапках и журналах, отображаются в основной рабочей области. По умолчанию в\nСистеме существуют 3 основных вида журналов: входящих, исходящих и\nвнутренних документов. При необходимости через конфигуратор возможно\nсоздание других типов журналов. Ниже журналов в навигаторе расположены\nдела. Дела также создаются методологом системы по необходимости согласно\nноменклатуре дел.\nСоздание и регистрация документов из вышеперечисленных журналов происходит с\nпомощью мастера регистрации документов. Для окна мастера регистрации\nдоступна функция сворачивания, при этом открыто может быть лишь одно\nокно. При наличии свернутого окна мастера и последующем открытии\nнезарегистрированного документа данный документ будет открываться в режиме\nпросмотра. В то же время, при наличии свернутого окна и нажатии на кнопку“Создать”данное окно развернется.\nЖурнал входящей корреспонденции используется для регистрации документов,\nпоступивших от сторонних организаций. Для каждого журнала и фильтра возле\nназвания отображается счетчик (количество) документов (см. илл. «Журнал\nвходящей корреспонденции»).\nFigure 7.37. Журнал входящей корреспонденции (строчный вид)\nFigure 7.38. Журнал входящей корреспонденции (табличный вид)\nДля регистрации входящего документа в данном журнале необходимо нажать\nкнопку «Создать» на верхней панели слева. В открывшейся карточке входящего\nдокумента необходимо заполнить поля, показанные на илл. «Карточка входящего\nдокумента»:\nFigure 7.39. Incoming document card\nКарточка входящего документа может содержать:\nкраткое содержание документа;\nномер документа;\nдата регистрации документа;\nтип документа;\nдата завершения либо длительность исполнения документа (возможны вариант как\nв рабочих, так и в календарных днях);\nкорреспондент(орг) и корреспондент;\nгалочку в соответствующем поле, если документ является контрольным;\nномер исх;\nдата исх;\nоснование;\nполе «Списать в» для списания документа в выбранный раздел номенклатуры дел\nпосле его исполнения (путем выбора папки, куда должен быть списан документ\nпосле исполнения).\nFigure 7.40. Case selection dialog\nНажатием кнопки«Далее»открывается второй шаг мастера:“Файлы”.\nFigure 7.41. Attaching files\nВ этом окне есть возможность прикрепить файл из компьютера, из хранилища\n(зарегистрированный документ в электронном виде)  либо сканировать документ.\nПримечание: процесс сканирования аналогичен таковому впотоках работ(см. илл.  «Сканирование документа в\nпользовательском агенте»).\nПосле прикрепления файла, нажимаем«Далее», переходим к\nвыбору исполнителя и маршрута.\nFigure 7.42. Selection of executor and route\nЕсли известно, какой маршрут будет соответствовать движению документа внутри\nорганизации, то тут же можно указать либо создать маршрут для этого\nдокумента. После ввода всех необходимых данных для сохранения документа в\nжурнале без присвоения регистрационного номера служит кнопка «Сохранить»,\nдля регистрации - кнопка «Зарегистрировать». При соблюдении всех условий\nрегистрации документа, автоматически появляется системный комментарий\n«Документ зарегистрирован за номером №…».\nПримечание\nЧтобы указать маршрут движения документа, необходимо маршрут добавить в\n«Избранное». Подробнее:Настройка\nмаршрутов. Кроме того, в данном списке возможен преднастроенный\nсписок шаблонов машрутов, в зависимости от настроек типа документа в\nКонфигураторе.\nПримечание\nПри определенных настройках типа документа в Конфигураторе появляется\nвозможность ввода комментария при регистрации документа. Введенный\nкомментарий отображается в ходе выполнения документа.\nWhen registrying a document in the journal of incoming correspondence, a\nwork is automatically created for a assignee executor in lists of workflows\nwith an attached file from incoming letter. In this letter number and name\nof document are displayed in the work title.\nWhen registrying draft internal document in incoming correspondence journal\n(setting document type as \"Internal\"), in workflow for assignee executor\nwork appears in form of draft document. Upon receipt of a registered project\ndocument, the assignee executor is able to see information in the document\nrecord: name, number, a summary of the document, date of registration, type\nof journal in which the document is registered, type of the document, full\nname of sender, dictionary number and date.\nOutgoing letter journal is used to register documents which are intended to\nbe sent to third companies.\nFigure 7.43. Outgoing letter journal\nIf a user registries incoming document the card is filled in with the\nfollowing data:\nFigure 7.44. Incoming document card\nПримечание\nThird step of wizard \"Selection of executor and route\" in the journal are\nabsent.\nAll other actions are similar to journal of incoming documents.\nЖурнал внутренних документов создан для регистрации документов, которые\nпредназначены для обмена внутри организации между его\nподразделениями. Документы внутри данного журнала классифицируются по\nфильтрам, аналогичным журналу входящей корреспонденции (см. илл. «Журнал\nвнутренних документов»).\nFigure 7.45. Internal document journal\nWhen registrying internal documents the card is filled with the following\ndata:\nFigure 7.46. Internal document card\nAll other actions are similar to journal of incoming documents.\nРаздел «Документы» должен позволять регистрацию документов в выбраном\nжурнале с заполнением регистрационно-контрольной карточки, прикреплением\nвложений и указанием исполнителя документа. Существует два вида регистрации\nдокумента: регистрируется новый документ; регистрируется документ созданный\nпользователем и отправленный на регистрацию (Подробнее описано в следующем\nразделе).\nВ журналах доступна опция автоматической регистрации документов при\nустановлении соответствующих настроек в конфигураторе. При наличии таких\nнастроек любой пользователь сам может зарегистрировать документ в журнале\nэлектронной канцелярии, если соблюдены все условия. Если условия не\nсоблюдены, то этап регистрации завершится тут же с указанием причины отказа.\nВ журналах доступен множественный выбор документов на странице, используя\nсочетанияCtrl+Left Mouse ClickлибоShift+Left Mouse Click.\nК выделенной группе могут быть применены действия контекстного меню\nдокументов, для которых имеет смысл обработка нескольких документов:\nДобавить на контроль/Снять с контроля\nПометить как бракованный/Убрать пометку бракованный\nСписать...\nКопировать в личное дело...\nДля редактирования документа нужно вызвать мастера регистрации. Для этого\nнужно вызвать контекстное меню на нужном документе, и выбрать пункт\n«Изменить» либо двойным щелчком по документу. При этом, если уже открыт хотя\nбы один мастер регистрации, то в меню всех остальных документов данный пункт\nбудет недоступен.\nДокументу можно установить свойство, является ли он контрольным, на первом\nшаге мастера регистрации, в РКК либо контекстном меню выделенного документа\n/ группы документов.  Для этого в карточке документа необходимо поставить\nгалочку в чекбоксе «Является контрольным» либо в контекстном меню выбрать\nпунктДобавить на контроль(обратно\nдействиеСнять с контроля).\nЕсли документ является контрольным, то на плашке отображается знак (!)\nкрасного цвета, а в модуле «Потоки работ» все работы по данному документу\nбудут подчеркнуты.\nFigure 7.47. Control document card\nОснование документа указывается на первом шаге мастера регистрации либо в\nРКК документа. Для этого нужно нажать кнопку выбора и в открывшемся окне\nвыбрать тип документа либо ввести название в поле текстового поиска.\nFigure 7.48. Basis selection window\nПосле того, как выбран необходимый документ как основание нужно нажать\nкнопку «Выбрать». Двойным кликом по выбранному документу можно его\nпросмотреть.\nLink between documents \"basis-affilated document\" is shown in the basis\nfield. If \"doc_1\" is shown as affilated document for \"doc_2\", corresponding\nnote is shown in list of bases for \"doc_1\" and versa vice.\nЕсли у сотрудника канцелярии есть доступ на резервирование номера ,то на\nпервом шаге мастера регистрации рядом с полем номер появляется кнопка“Выбор зарезервированного номера”.\nFigure 7.49. Document card with an option to choose reserved number\nПо нажатию на кнопку“Выбор зарезервированного номера”открывается список всех зарезервированных номеров(при наличии) с\nвозможностью добавить новый.\nFigure 7.50. Dialog of creation and selection reserved numbers\nWhen adding new element, a user selects a number and enters a comment.\nFigure 7.51. Adding number to reserve\nПо умолчанию, отображается следующий незарегистрированный номер\nсчетчика. Номер выбирается с помощью стрелочек влево/вправо с единичным\nшагом только из незарезервированных номеров. При добавлении номера в резерв,\nможно добавить комментарий к резервируемому номеру. После резервирования в\nокне“Номер”, отображается следующая информация: номер, автор\nизменений, дата и комментарий. Для редактирования комментария необходимо\nвызвать контекстное меню, и выбрать пункт“Редактировать\nкомментарий”. Внести изменения и нажать кнопку“Сохранить”.\nFor workers of chancery without access to reserve of numbers documents are\nregistered under next number of counter.\nСотрудник канцелярии, имеющий доступ на редактирование журнала может\nпометить документ из этого журнала, какбракованный. Для этого нужно выделить один либо\nнесколько документов и вызвать контекстное меню, выбрать пункт «Пометить как\nбракованный». При этом обязательным требованием является ввод комментария, с\nуказанием причины, также можно завершить все работы по этому документу\nпоставив галочку в чекбоксе.\nИспользуется для списания зарегистрированного документа в выбранный раздел\nноменклатуры дел после его исполнения.\nСписать документ можно несколькими способами: на первом шаге мастера\nрегистрации, в РКК либо через контекстное меню выделенного документа /\nгруппы документов. Для этого в карточке документа необходимо нажать кнопку\nвыбора, расположенную справа от поля «Списать в», Система предоставляет окно\nвыбора дела. В другом случае нужно выделить один либо несколько документов\nдля списания и вызвать контекстное меню, выбрать пункт меню «Списать…»,\nпосле чего также откроется окно выбора дела.\nОпционально, в зависимости от настроек конфигуратора, доступен пункт\nконтекстного меню“Экспортировать”, позволяющий осуществлять\nэкспорт документов журнала в виде архива, содержащего файлы документа,\nподписи (в т.ч. ЭЦП), а также прочую информацию о документе.\nПункт контекстного меню выделенного документа / группы документов“Копировать в личное дело”доступен только пользователю с\nролями“Сотрудник отдела кадров”и“Сотрудник\nканцелярии”и позволяет копировать документ из журнала в личное дело\nсотрудника. В открывшемся окне“Копировать в личное дело”необходимо указать одного либо несколько пользователей, папку личного дела и\nнажать кнопку“Отправить”.\nFigure 7.52. Copying to personnell file\nWorking documents\nВсе документы, с которыми когда-либо сталкивался пользователь отображаются в\nузле“Все”. При настроенном аккаунте (учетной записи)\nэлектронной почты пользователя, входящие электронные письма будут попадать в\nузел Полученные, отправленные сообщения в узел Отправленные. Примеры\nвходящих/исходящих сообщении приведены ниже:\nFigure 7.53. Incoming letter\nFigure 7.54. Outgoing letter\nПользователю могут быть доступны следующие действия с документами:\nИзменить маршрут...\nОтметить как прочитанное/Отметить как непрочитанное\nЭкспортировать\nСкрыть/Восстановить\nПрервать маршрут\nВ разделе“Все”доступен множественный выбор документов на\nстранице, используя сочетанияCtrl+Left Mouse ClickлибоShift+Left Mouse Click.\nК выделенной группе могут быть применены действия контекстного меню\nдокументов, для которых имеет смысл обработка нескольких документов:\nОтметить как прочитанное/Отметить как непрочитанное\nСкрыть/Восстановить\nДля изменения предстоящих маршрутов документов по реестру необходимо в\nконтекстном меню выбрать пункт «Изменить маршрут». По нажатию откроется\nсовмещенный маршрут состоящий из предварительных этапов, действий и\nпоследующих этапов.  Изменению подлежат только предварительные и последующие\nэтапы (еще не запущенные этапы маршрута).\nFigure 7.55. Changing route\nДля того, чтобы отметить выделенный документ / группу документов как\nпрочитанное, необходимо вызвать контекстное меню непрочитанного документа /\nгруппы документов и выбрать пункт“Отметить как\nпрочитанное”. Для прочитанного, соответственно, выбрать пункт“Отметить как непрочитанное”.\nТакже можно“Скрыть”документ / группу документов, они не будут\nотображаться в фильтрах. Для того, чтобы просматривать скрытые документы,\nможно создать фильтр с указанием свойства“Скрытый”, в котором\nбудут отображаться все скрытые документы. Скрытый документ можно“Восстановить”, для этого нужно перейти в фильтр скрытых\nдокументов, и в контекстном меню документа / группы документов выбрать пункт“Восстановить”.  Восстановленный документ попадает в фильтр, в\nкотором находился до скрытия.\nОпционально, в зависимости от настроек конфигуратора, доступен пункт\nконтекстного меню“Экспортировать”, позволяющий осуществлять\nэкспорт документов в виде архива, содержащего файлы документа, подписи (в\nт.ч. ЭЦП), а также прочую информацию о документе.\nДля того, чтобы прервать запущенный по документу маршрут, необходимо вызвать\nконтекстное меню документа и выбрать пункт“Прервать\nмаршрут”. Если по документу запущено несколько маршрутов, то\nоткрывается подменю, где перечислены запущенные маршруты. При прерывании\nмаршрута текущие этапы удаляются, и соответствующая запись отображается в“Ходе выполнения”документа. Будущие этапы прерванного маршрута\nнигде не отображаются.\nFilters\nДля каждого из корневых веток и подветок раздела“Документы”-“Журналы”,“Дела”,“Все”можно\nсоздать специализированные подфильтры. Каждый подфильтр содержит название,\nиконку и условия фильтрации.\nSubfilters can be created inside root branches or other subfilters using\ncontext menu:\nдля основных фильтров“Добавить фильтр”- добавляет подфильтр;\nдля подфильтров“Добавить фильтр”- добавляет вложенный\nподфильтр;\n“Редактировать фильтр”- можно добавить, удалить и изменить\nсодержимое условий фильтра;\n“Удалить фильтр”- удаляет выделенный подфильтр.\nВ системе предусмотрены следующие условия фильтрации: краткое содержание,\nномер, тип документа, статус, дата регистрации, номер исх., дата исх.,\nкорреспондент, корреспондент (орг), автор, зарегистрировал, исполнитель,\nдлительность, контрольные, бракованные, скрытые (отображается только для\nфильтров раздела «Все» и его подразделов).\nТочный список условий фильтра зависит от просматриваемого журнала, его типов\nдокументов и настроек карточки. Для дел ивсехдокументов этот список неизменяем.\nУсловия для подфильтров:\n“Краткое содержание”- регистронечувствительно, соответствие\nчасти значения поля“Кр. содерж.”РКК любому из списка тегов\n(связь“ИЛИ”для тегов). Несоотвествие части значения поля“Кр.  содерж.”РКК каждому из списка тегов (связь“И”).\n“Номер”- регистронечувствительно, соответствие части значения\nполя“Номер”РКК любому из списка тегов (связь“ИЛИ”для тегов).  Несоотвествие части значения поля“Номер”РКК каждому из списка тегов (связь“И”).\n“Тип документа”- соответствие любой из комбинации настроенных\nв системе типов документов. Выбранные значения в поле отображаются в виде\nтегов, которые можно удалить, нажав на крестик справа от названия.\n“Статус документа”- соответствие любой из комбинации статусов\nдокумента:“Черновик”,“На регистрации”,“На\nисполнении”,“Просроченные”,“Завершен”,“Отклонен”. Выбранные значения в поле отображаются в виде\nтегов, которые можно удалить, нажав на крестик справа от названия.\nПримечание\n“На исполнении”соответствует статусу документа“В\nработе”,“Просроченные”- статусу документа“Есть\nпросроченные”.\n“Дата регистрации”- выбор одного из вариантов:“Произвольный”,“Неделя”,“Месяц”,“Квартал”. При выборе варианта“Произвольный”появляется возможность указать две даты - начала и завершения произвольного\nпериода.\n“Номер исх.”- регистронечувствительно, соответствие части\nзначения поля“Номер исх.”РКК любому из списка тегов (связь“ИЛИ”для тегов). Несоотвествие части значения поля“Номер исх.”РКК каждому из списка тегов (связь“И”).\n“Дата исх.”- выбор одного из вариантов:“Произвольный”,“Неделя”,“Месяц”,“Квартал”. При выборе варианта“Произвольный”появляется возможность указать две даты - начала и завершения произвольного\nпериода.\n“Корреспондент”- регистронечувствительно, соответствие части\nзначения поля“Корреспондент”РКК любому из списка тегов (связь“ИЛИ”для тегов). Несоотвествие части значения поля“Корреспондент”РКК каждому из списка тегов (связь“И”).\n“Корреспондент (орг)”- регистронечувствительно, соответствие\nчасти значения поля“Корреспондент (орг)”РКК любому из списка\nтегов (связь“ИЛИ”для тегов). Несоотвествие части значения\nполя“Корреспондент (орг)”РКК каждому из списка тегов (связь“И”).\n“Автор”- соответствие любой из выбранной комбинации\nпользователей. Выбранные пользователи в поле отображаются в виде тегов,\nкоторые можно удалить, нажав на крестик справа от фамилии.\n“Зарегистрировал”- соответствие любой из выбранной комбинации\nпользователей. Выбранные пользователи в поле отображаются в виде тегов,\nкоторые можно удалить, нажав на крестик справа от фамилии.\n“Исполнитель”- соответствие значения поля“Определить\nисполнителя”РКК любой из выбранной комбинации\nпользователей. Выбранные пользователи в поле отображаются в виде тегов,\nкоторые можно удалить, нажав на крестик справа от фамилии.\n“Длительность”- два поля ввода натуральных чисел,“От”и“До”. Значение одного из этих полей может\nбыть пустым.\n“Контрольные”- выбор одного из вариантов:“Только\nконтрольные”,“Без контрольных”.\nПримечание\nЧтобы в списке документов присутствовали и контрольные, и не контрольные\nдокументы одновременно, условие“Контрольные”в фильтр\nдобавлять не нужно (т.к. в данном случае это свойство будет наследоваться от\nродительского фильтра, который таким свойством уже обладает).\n“Бракованные”- выбор одного из вариантов:“Все, включая\nбракованные”,“Только контрольные”.\nПримечание\nЧтобы в списке документов присутствовали только не бракованные документы,\nусловие“Бракованные”в фильтр добавлять не нужно (т.к. в\nданном случае это свойство будет наследоваться от родительского фильтра,\nкоторый таким свойством уже обладает).\n“Скрытые”- выбор одного из вариантов:“Все, включая\nскрытые”,“Только скрытые”. Условие отображается только\nдля фильтров раздела“Мои”и его подразделов.\nПримечание\nЧтобы в списке документов присутствовали только не скрытые документы,\nусловие“Скрытые”в фильтр добавлять не нужно (т.к. в данном\nслучае это свойство будет наследоваться от родительского фильтра, который\nтаким свойством уже обладает).\n“В процессе”- выбор одного из вариантов:“Только в\nпроцессе”,“Без документов в процессе”. Документ\nсчитается находящимся в процессе, если по нему имеется хотя бы одна\nнезавершенная работа либо какой-либо другой процесс.\nПримечание\nЧтобы в списке документов присутствовали документы как в процессе, так и не\nв процессе, условие“В процессе”в фильтр добавлять не нужно\n(т.к. в данном случае это свойство будет наследоваться от родительского\nфильтра, который таким свойством уже обладает).\nFigure 7.56. Создание нового фильтра\nСправа от каждого условия расположена пиктограмма удаления, по нажатию на\nкоторую система сразу удаляет условие.\nВ разделе“Сортировать по полю”устанавливаются условия\nсортировки фильтра. Условие сортировки представляет собой набор параметров,\nкаждый из которых содержит спискиПоле\nсортировки,Направление\nсортировкииСоединение.\nПараметры условия сортировки между собой можно соединять только оператором\n«затем по» (логическое «И»). Новый параметр можно добавить, выбрав в списке\nсоединения значение «затем по» (по умолчанию там указано пустое значение),\nпри этом появляется новая строка, связанная с предыдущей через логическое\n«И». После этого из списка соединения пункт с пустым значением пропадает -\nбольше его выбрать нельзя. Удалить параметр сортировки (кроме первого)\nможно, нажав на соответствующую иконку «корзины». Если удаляемый параметр\nявляется последним, то у предыдущего параметра значение соединения\nвыставляется в пустое.\nВыпадающий списокПоле сортировкиможет\nсодержать следующие параметры:“Краткое содержание”,“Номер”,“Тип документа”,“Статус”,“Дата регистрации”(выбран по умолчанию),“Автор”,“Зарегистрировал”,“Исполнитель”,“Длительность (раб.дн.)”, далее идут динамически формируемые\nпункты в форматеЭлемент номера №п/п -, и\nдалее соответствие частям шаблона номера, выбранного для данного журнала,\nисключая стандартные счетчики даты регистрации,“Дата\nсоздания”,“Дата получения”,“Дата\nотправки”,“Дата получения/отправки”.\nВыпадающий списокНаправление сортировкидолжен содержать:“по возрастанию”и“по убыванию”(выбран по умолчанию).\nВыпадающий списокСоединениедолжен\nсодержать: пустое значение (выбран по умолчанию) и“затем по”.\nПримечание\nМожно использовать настройки сортировки, настроенные в Конфигураторе по\nумолчанию.",
    "Chapter 8. \"Projects\" module\nРевизия VCS: 3c3e04345\nДата сборки документа: \n\t\t\t\t\t2023.11.09 17:03:53\nTable of Contents\nCreating, distributing and controlling projects\nМодуль «Проекты» предназначен для создания, распределения и контроля\nмероприятий в рамках проекта. Совокупность планируемых мероприятий,\nнаправленных на достижение одного конечного результата, в рамках\nограниченных сроков, ресурсов и бюджета.  Выглядит он следующим образом:\nFigure 8.1. \"Projects\" module\nNavigator window shows folders \"Favourites\", \"Corporate project portfolio\ntree\", and personal \"My projects\".\nПортфели проектов создаются и настраиваются методологом в конфигураторе. Для\nкаждого портфеля методолог указывает менеджера - пользователя, который\nотвечает за расположение проектов в данном портфеле, назначение прав доступа\nк портфелю и указывает бюджет портфеля. Портфель проектов может содержать\nкак проекты, так и другие вложенных портфели.\nБюджет портфеля проектов рассчитывается, как сумма стоимости каждого\nпроекта. План/факт бюджета выводится в соответствующие системные показатели.\nВ настройках портфеля отображается его название, портфель проектов можно\nсвязать с существующими целями компании (максимум 3), а также указывается\nбюджет портфеля.\nFigure 8.2. Настройки портфеля проектов\nВо вкладке «Права», доступной для редактирования только менеджеру,\nнастраиваются права на данные портфель проектов. Выключенная галочка\nпредполагает право только на чтение портфеля, включенная же - дополнительно\nправо на запись (возможность создавать проекты в портфеле без утверждения,\nредактировать настройки и дополнительные поля портфеля.\nДобавление права на портфель автоматически добавляет данному пользователю\nправо на чтение каждому из вложенных проектов (если у него такое право\nотсутствует в списке прав на проект).\nВ обратной же ситуации, удаление права на портфель не удаляет автоматически\nправа на все вложенные проекты. В случае такой необходимости, нужно в каждом\nпроекте удалить пользователю права.\nFigure 8.3. Настройки портфеля проектов, вкладка «Права»\nДобавить/удалить дополнительные поля для портфеля, а также настроить порядок\nих отображения можно на вкладке“Дополнительные поля”.\nДля добавления дополнительного поля в проекты нажмите кнопку“Добавить”и из представленного списка выберите нужное\nполе. Настройка порядка отображения дополнительных полей выполняется с\nпомощью пункта контекстного меню“Переместить выше/ниже”.\nПримечание\nЕсли вы хотите добавить дополнительные поля к проекту, обратитесь к своему\nметодологу.\nFigure 8.4. Настройка дополнительных полей портфеля проектов\nПользователь имеет возможность создать проект в личной папке «Мои\nпроекты». Для перенесения проекта из личной папки в портфель, необходимо\nвызвать правой кнопкой мыши контекстное меню и выбрать пункт «Перенести в\nобщекорпоративное дерево…». Если у пользователя нет прав доступа на\nдобавления проекта в портфель, проект отобразится в нем курсивом и для\nменеджера проекта будет создана работа - заявка на утверждения расположения\nпроекта в данном портфеле.\nA project can be selected as favorite (by clicking star): its  link will be\nshown in \"Favourites\" folder.\nКроме того, нижнюю панель и диаграмму Ганта можно разворачивать и скрывать,\nдля этого в заголовке панели присутствуют две кнопки — «Диаграмма» и\n«Детали» соответственно. Для того, чтобы добавить новый проект, следует\nнажать кнопку «Создать» и выбрать пункт меню «Создать новый проект…». Этот\nпункт меню вызывает окно (илл. «Окно для создания нового проекта»), в\nкотором вводятся параметры корневого элемента проекта:\nDescription (name) of project;\ncode (filled in automatically);\nдата начала и длительность либо дата начала и дата конца (в зависимости от\nнастроек проектов);\nшаблон проекта (при наличии настроенных шаблонов);\nworkload in % or hours of working time;\ncosts of project (planned/actual);\nрасположение проекта;\nдополнительные поля (произвольная текстовая строка, содержащая числовое\nзначение, произвольный текст либо значение из справочника, которые\nвыбираются из записей справочникаpm_custom_fields).\nПримечание\nUnit of measurement of costs of project is selected by methodologist in the\nConfigurator.\nFigure 8.5. New project creation dialog\nКнопка «Создать» создаёт новый проект. При создании проекту автоматически\nнастраиваются следующие права:\nавтор и владелец проекта имеет все права;\nпользователи с любым набором прав на портфель, содержащий данные проект,\nимеют право на чтение.\nПосле создания проект появляется в списке. В данном списке указывается:\nNumber of project;\nName of project;\nProject duration in working days;\nStart date;\nCompletion date;\nDependences of arrangements;\nAssignee for execution;\nProgress of project implementation;\nGannt's diagram showing assignments in time and general work load.\nЕсли при создании проекта был выбран шаблон проекта, то в основной рабочей\nобласти модуля отобразятся мероприятия с установленными длительностью и\nзависимостями согласно данному шаблону. Настройки проекта также будут\nсоответствовать этому преднастроенному шаблону.\nПри создании проекта автоматически создается папка проекта со специальной\nструктурой папок:\nвиртуальные папки (папки с синей иконкой) - особые папки, повторяющие\nструктуру мероприятий проекта. Их нельзя изменить (переместить,\nпереименовать, удалить) непосредственно в панели“Детали”, но\nможно создавать в них обычные (физические) папки и файлы;\nпапка“Файлы работ”- это папка внутри виртуальной, создается\nтолько для мероприятий с ответственными и содержит все файлы всех документов\nне удаленных работ этих ответственных;\nфизические папки (папки с желтой иконкой) - обычные папки, доступные для\nредактирования в панели“Детали”;\nпапка“Корзина”(папка с иконкой корзины) - особая папка,\nдоступная владельцу проекта. Ее поведение регламентируется настройками\nпроекта.\nПри нажатии на кнопку «Детали» на панели сверху в нижней панели появляется\nподробная информация, содержащая документы Проекта (отображающая описанную\nструктуру папки проекта), участников и комментарии. Для добавления ссылки на\nдокументы и создания новой физической папки можно воспользоваться следующими\nспособами (доступны только для пользователей, имеющих права записи в\nпроект):\nс компьютера (без предварительного добавления в Хранилище Системы,\nнепосредственно в папку Проекта);\nс хранилища (добавление ярлыков на файлы из папок Хранилища);\nсоздать новый (создание нового HTD-документа);\nсканировать;\nсоздать папку (данный пункт меню всегда отсутствует в папке“Файлы\nработ”).\nПримечание: процесс сканирования аналогичен таковому впотоках работ(см. илл. «Сканирование документа в\nпользовательском агенте»).\nПри этом с файлами и папками в деталях проекта можно путем вызова\nконтекстного меню производить различные действия, а именно для файлов:\nскачать;\nскачать PDF версию (конвертирование файла в PDF формат и скачивание в\nвыбранную директорию);\nсделать основным (данный пункт меню присутствует только в папке“Файлы\nработ”)\nновая версия (указание новой версии файла, которая заменит старую);\nпереименовать (данный пункт меню всегда отсутствует в папке“Файлы\nработ”);\nпереместить (данный пункт меню всегда отсутствует в папке“Файлы\nработ”);\nудалить;\nскачать все“Приложения”(для папки“Приложения”)\n/ скачать все“Прочие”(для папки“Прочие”)\n(данный пункт присутствует только в папке“Файлы работ”).\nДля папок:\nпереименовать;\nпереместить;\nудалить;\nПункты меню, за исключением скачивания, в том числе PDF версии, могут быть\nнедоступны для файлов и папок в случае отсутствия у пользователя прав записи\nв мероприятие (либо в проект), в котором эти файлы и папки\nлежат. Вышеупомянутые пункты скачивания файла доступны и при наличии у\nпользователя прав на чтение.\nВо вкладке общих настроек проекта можно выбрать владельца (автора)  проекта\nи паспорт проекта. Ниже расположена ссылка на проект (абсолютная /\nотносительная), которая позволяет открыть данный проект по прямой\nссылке. При выделенном в дереве проекте ссылка на проект также отображается\nв адресной строке браузера.\nFigure 8.6. Настройки проекта, вкладка «Общие»\nПримечание\nВладельцем (автором) проекта может быть только пользователь, у которого есть\nполные права на данный проект.\nВ качестве паспорта проекта можно указать произвольный документ, в\nт.ч. документ по реестру (cм. илл. «Окно выбора паспорта проекта»).\nЕсли проект был создан по шаблону, в данной влкадке отобразится название\nэтого шаблона.\nFigure 8.7. Project passport selection window\nВо вкладке“Настройки”можно изменить дату начала проекта,\nнастроить ограничение сроков проекта, тип расчета сроков (автоматический /\nручной), тип расчета прогресса (среднее арифметическое / среднее взвешенное\nзначение), перерасчет прогресса при изменении сроков, вес мероприятия,\nспособ ввода сроков (стандартный / абсолютный), тип прогресса (Фактический\nпрогресс и Прогресс по работе / Фактический прогресс и Плановый прогресс) и\nдействия с файлами папок мероприятия при удалении мероприятия (Перемещать в\nпапку уровнем выше / Перемещать в корневую папку / Создавать папку“Корзина”).\nПримечание\nПри выборе типа расчета прогресса“Среднее взвешенное”,\nобязательно нужно указать поле, которое будет обозначать вес\nмероприятия. Если у вас нет доступных полей, то необходимо добавить\nдополнительные поля к проекту.\nFigure 8.8. Настройки проекта, вкладка «Настройки»\nNext tab of settings dialog allows to manage possible risks of the\nproject. \"Risk management\" tab allows to create risks and indicate name of\nthe risk, its category, type, status, influence type, risk probability (in\n%), assignee person, and description of measures to mitigate risk completely\nor non-completely.\nRisk management is process of taking and implementing executor solutions\naimed at decreasing probability of unfavorable result and minimizing\npossible losses stemming from its realization.\nRisk management is aimed at increasing work efficiency using protection of\nimplementation of clear risks.\nDuring creation of project, project manager is able to indicate places of\npossible project failures (risks), describe them, and suggest actions\n(measures) which are required to take if the risk has happened. To describe\na risk, determine its probability, its project influence, assignee for the\nrisk, and describe measures to mitigate its influence. If project influence\nor probability of a risk is low, the manager can just describe the risk as\nunlikely and describe no measures to mitigate it.\nВ проектном управлении риски делятся на типы, их стандартный набор есть в\nСистеме. Если необходимо изменить существующие типы рисков или добавить\nновые — данные действия доступны методологу системы в разделе «Категории\nрисков».\nDefault types of risks in the System:\nInstitutional risks;\nCommercial risks;\nSocial risks;\nTechnical risks;\nFinancial risks;\nEcological risks.\nДля добавления риска к проекту нужно в окне настроек проекта перейти во\nвкладку «Управление рисками». Во вкладке отобразятся ранее созданные риски\nпроекта (илл. «Настройки проекта, вкладка «Управление рисками»»).\nFigure 8.9. Настройки проекта, вкладка «Управление рисками»\nДля добавления нового риска нужно нажать на кнопку «Добавить» и заполнить\nвсе поля. Для редактирования существующего риска нужно открыть его и внести\nнеобходимые изменения (илл. «Редактирование риска проекта»).\nFigure 8.10. Editing project risks\nВо вкладке «Участники» можно просматривать и редактировать список участников\nпроекта.\nFigure 8.11. Настройки проекта, вкладка «Участники»\nДля просмотра всех прав на проект и ветки проекта в окне формируется список\nпользователей (илл. «Настройки проекта, вкладка «Права»»).\nСписок возможных прав на проекты:\nReading - allows reading of project;\nWriting - allows editing project, including creating arrangements, changing,\ndeleting and changes progress of arrangements;\nSetting rights - allows setting rights for the project to any other user;\nCommenting - allows commenting arrangements of project;\nSetting assignee ones - allows setting assignee ones for arrangements and\nproject branches.\nДля редактирования списка необходимо наличие права“Назначение\nправ”.\nВ данной вкладке можно добавлять права только на весь проект.  Добавление\nправ на определенную ветку проекта доступна через редактирование\nсоответствующего мероприятия. Для добавления пользователю прав на весь\nпроект, необходимо нажать на кнопку «Добавить». Далее выбор пользователей\nосуществляется аналогично описанному выше процессу выбора пользователей для\nутверждения проекта. После того, как список пользователей сформирован,\nнеобходимо нажать кнопку «Сохранить». Это означает, что выбранные\nпользователи получили право на просмотр всего проекта. Для назначения\nпользователю других прав на проект, необходимо кликнуть дважды в\nсоответствующей строке с фамилией пользователя. В открывшемся диалоге со\nсписком прав выбрать нужное и нажать кнопку «Принять». Назначенные права\nпользователя отобразятся через запятую в графе «Права».\nВ данной вкладке можно удалять любые права (как на весь проект, так и на его\nветки). Для удаления нужно кликнуть правой кнопкой мыши на строку с правами,\nвыбрать «Удалить права».\nДля сохранения выполненных изменений нажать на кнопку «Сохранить» в окне\nправ на проекты.\nFigure 8.12. Настройки проекта, вкладка «Права»\nIn \"Appearance\" tab you can select main and additional fields for\ndisplaying:\nДлительность\nНачало\nЗавершение\nЗависит\nОтветственный\nПлановая стоимость\nФактическая стоимость\nдополнительные поля проекта\nПрогресс\nПримечание\nПоля“Номер”и“Название”отображаются\nвсегда. Настройка вида отображения проекта сохраняется только для\nпользователя, который ее задал.\nFigure 8.13. Настройки проекта, вкладка «Внешний вид»\nДобавить/удалить дополнительные поля для проекта, а также настроить порядок\nих отображения можно на вкладке“Дополнительные поля”.\nДля добавления дополнительного поля в проекты нажмите кнопку“Добавить”и из представленного списка выберите нужное\nполе. Настройка порядка отображения дополнительных полей выполняется с\nпомощью пункта контекстного меню“Переместить выше/ниже”.\nПримечание\nIf you want to add additional fields for your project, ask your\nmethodologist.\nFigure 8.14. Настройка дополнительных полей проекта\nIn order to add an arrangement to the project, click \"Create arrangement\"\nbutton (button with + image) located in the left part of main panel\nheading. This will display arrangement add window:\nFigure 8.15. Adding new arrangement to project\nMaximal duration for one arrangement is limited up to 9 999 working days.\nEnter the following values in the window:\nформулировка (название) мероприятия;\nmilestone (control point);\nstart date and duration of arrangement (in working days);\nwork load in % of working time;\nстоимость (план / факт)\nПримечание\nUnit of measurement of costs of project is selected by methodologist in the\nConfigurator.\nКнопка «Создать» создаёт новое мероприятие. При создании права на данное\nмероприятие автоматически наследуются от ближайшего родительского. После\nсоздания новое мероприятие появится в списке.  Плановая и фактическая\nстоимость группового мероприятия (и всего проекта) рассчитывается\nавтоматически.\nМероприятие можно связать как с вехой, так и с другим мероприятием. Есть два\nспособа связывания мероприятий: графический и с цифровым указанием\nпредшествующего. Графический способ привязки выполняется на диаграмме Ганта\n(илл. «Диаграмма Ганта»), наведением курсора мыши на начало или конец\nмероприятия до появления стрелки, далее необходимо нажать левую кнопку мыши\nи перетащить стрелку до начала или конца того мероприятия, с которым его\nнеобходимо связать.\nПримечание\nПри открытой диаграмме Ганта добавление мероприятий невозможно.\nGannt's diagram is a powerful analytic tool to plan and visualize\nprojects. The diagram is a figure with time line as a horizontal line and\nlist of arrangements located along vertical line. The length of lines\ndepicting arrangements is proportional to length of tasks; also, connection\nlines between arrangements are shown.\nIf you use digital way to connect arrangements, enter number of arrangement\non which the selected one depends in the \"Depends on\" field.\nПосле привязки мероприятий друг с другом можно указать тип их\nзависимости. Для этого необходимо на диаграмме Ганта нажать на стрелку\nзависимости и в открывшемся окне выбрать нужный тип связи.  Система\nразличает 4 типа зависимости (связи) мероприятий:\nfinish-start (FS) indicates finish of one arrangement is the start of second\none which depends on it;\nfinish-finish (FF) indicates the same time of finishing two arrangements\nwhich depend one on another;\nstart-start (SS) indicates the same time of starting two arrangements which\ndepend one on another;\nstart-finish (SF) indicates start of one arrangement is the end of second\none which depends on it.\nApart from the above-listed types of connections, every dependence often has\na modifier + - N days which reflects how many days concludes tolerance of\ndate of start of an arrangement from the entered. For example, if a\ndependence is \"start - start + 2 days\" if the first work starts on\n01.01.2012, the second one starts on 03.02.2012.\nFigure 8.16. Gannt's diagram\nResource hystogram is representation of project data in graphical\nview. Usually, it is used by project managers in order to show work load in\nevery participant of the project. Resource use is shown as horizontally\ndisplayed squares in scale of time. Using the hystogram we see level of work\nload of a participant in the project; this is shown by color of the\nsquares. Load up to 40% is shown as green, from 40% to 60% as light brown,\nfrom 60% to 100% as brown, from 100% and higher as red (overload).\nFigure 8.17. Resource hystogram\nIf a user has rights to the project, he or she can set any arrangement of\nthe project taken on control using \"Work control\" context menu item with\ndrop-down list of assignee ones.\nРедактировать мероприятие можно с помощью контекстного меню, выбрав пункт\n«Изменить», изначально выделив его, либо выполнить двойной клик по\nформулировке мероприятия. Также система позволяет редактировать мероприятия\nпроекта с помощью клавиатуры, а именно нажатием кнопки F2 на клавиатуре, для\nподтверждения введённых изменений - клавишей Enter и для отмены\nредактирования - клавишей Esc.\nFigure 8.18. Edit arrangement\nРедактировать также можно мероприятия, созданные другими пользователями, при\nналичии права“Запись”. При удалении мероприятии проекта они\nзавершаются каскадом с текущим прогрессом, который был на момент удаления.\nEdit window has the same states connected to work results for arrangement\nprogress and confirmation or cancelling work result if progress is set to\n100%.\nНа втором шаге окна редактирования проекта либо мероприятия отображается\nсписок прав:\nна мероприятие, из которого был вызван данный диалог, даже если его набор\nправ не отличается от набора прав ближайшего родительского;\nна те дочерние мероприятия, набор прав в которых отличается от набора прав\nна ближайшее родительское.\nЕсли есть право на назначение прав на данную ветку мероприятий, то в окне\nредактирования мероприятия имеется возможность добавления, изменения и\nудаления прав только на данную ветку проекта. Если такого права нет, кнопка\n«Добавить» должна быть недоступной, а таблица должна отображаться только для\nчтения.\nПримечание\nПрава на проекты являются наследуемыми, т.е. если дать права на групповое\nмероприятие, то такой же набор прав должен быть унаследован на все те его\nдочерние мероприятия, которым не был настроен какой-либо другой\n(отличающийся от родительского) набор прав.\nПрава на проекты являются исключающими, т.е. после того, как дали права на\nгрупповое мероприятие, на любое его дочернее мероприятие права можно\nограничить и даже вовсе исключить.\nТаким образом образом можно добиться того, что пользователю будет доступна\nтолько часть проекта, в котором структурные номера будут идти не по порядку,\nи это не будет являться ошибкой Системы.",
    "Setting assignee ones for project execution\nTo show list of all assignee persons for a project, select a project, click\n\"Details\" button on the top panel and click \"Assignee ones\" tab on the lower\npanel.\nFigure 8.19. List of project assignee ones\nДля назначения ответственного за то или иное мероприятие проекта нужно\nвыполнить двойной клик по строке мероприятия в графе «Ответственный», что\nвызовет окно для выбора ответственного пользователя (см. илл. «Выбор\nответственного»). Ответственным может быть назначен как сотрудник из данного\nподразделения, так и сотрудники других подразделении, не являющиеся\nнепосредственными подчинёнными.\nFigure 8.20. Selection of assignee\nTo set an employee as a assignee, select the employee from list of project\nparticipants. A user will be shown in the list of assignee ones where he or\nshe is able to indicate or change form of completion.\nFigure 8.21. Selection of assignee ones from organization structure tree\nTo select a user who is not a participant of the project, click \"Add a\nassignee\" button. In the user selection dialog with the following lists\nselect the required employee:\nSelected;\nFrequently selected;\nГруппы пользователей;\nSelection from organization structure\nAfter selection of a user, click \"Save\" button to set the selected user as a\nassignee for the project or \"Cancel\" to cancel. In the first case, the\nselected user is added to participants of the project and is set as assignee\nfor execution of the given project item.\nПосле перечисленных действий все ответственные за мероприятия проекта\nпопадают в список ответственных за проект и отображаются на нижней панели во\nвкладке «Ответственные» (см. илл. «Список ответственных за проект»).\nAssignee for a group of arrangements in the Projects are set in the same way\nas assignee is set for one arrangement of the Project.\nПримечание\nThe assignee ones will get request for execution or the work only following\nmandatory approval of the project.\nПри назначении ответственными сотрудников, не являющихся непосредственными\nподчинёнными, такие сотрудники получат запрос на выполнение работы, который\nотобразится в их ежедневнике в виде сообщения (илл. «Сообщение о\nподтверждении участия в мероприятии»). Запрос может быть либо подтверждён\nлибо отклонён.\nRequest on confirming participation in arrangement:\nFigure 8.22. Request on confirming participation in arrangement",
    "Approving project\nДля утверждение проекта необходимо выделить сам проект, вызвать контекстное\nменю и выбрать пункт «Утверждение проекта». Пункт меню доступен только\nвладельцу проекта. Пункт меню становится недоступным владельцу в случае\nимеющейся заявки на согласование с другими сотрудниками. При выборе данного\nпункта меню открывается диалоговое окно «Утверждение проекта» (илл. «Окно\nутверждения проекта»):\nFigure 8.23. Agree project window\nПри выборе варианта“Утвердить без согласования”проект\nполучает статус «Согласование без процесса».\nПри выборе варианта“Согласовать проект”появляется возможность\nуказать сотрудников в компоненте выбора пользователя.  В окне можно найти\nпользователя по имени и фамилии в строке «Поиск» либо выбрать из дерева\nорганизационной структуры или из дерева группы пользователей, выделив мышью\nнужных пользователей, которые формируются Системой автоматически. Выбранным\nсотрудникам добавляется работа-согласование с названием «Согласование\nпроекта %Название проекта%» в потоках работ.\nFigure 8.24. User selection window\nПримечание\nIt is forbidden to change project, project arrangements, assignee persons,\netc. during its approval, so the System automatically blocks any of these\nactions after the project is submitted for approval.\nВсе утверждения проекта можно просмотреть в истории согласований, которое\nвызывается контекстным меню проекта и выбором пункта «История согласований».\nFigure 8.25. История согласований\nПо каждой заявке на утверждение проекта создается запись в истории\nсогласований (каждая запись помещается в отдельную панель). В названии\nзаписи указывается дата подачи и через дефис дата закрытия заявки на\nутверждение, а также ФИО пользователя, подавшего заявку.\nРезультатом согласования может быть один из следующих статусов:\n«-»: заявка не обработана, либо один из согласовывающих отказался от\nсогласования (удалил работу о согласовании в потоке работ);\n«согласовано»: заявка утверждена всеми согласовывающими;\n«не согласовано»: один или все согласовывающие не утвердили заявку (отказ в\nсогласовании);.\nДалее отображаются список всех согласовывающих сотрудников и, приналичии, их\nкомментарии.",
    "Forming project\nМероприятия могут быть «вложены» в другие мероприятия, т. е. любое\nмероприятие можно разбить на множество подмероприятий. При этом общий\nпрогресс узлового мероприятия рассчитывается автоматически (ручное изменение\nпрогресса невозможно), как среднее арифметическое либо как среднее\nвзвешенное значение прогресса подмероприятий, в зависимости от указанного\nтипа расчета прогресса.\nДля того, чтобы создать новое подмероприятие нужно выделить родительское\nмероприятие и создать новое. Второй вариант – переместить существующее\nмероприятие на другое (Drag and drop), в итоге переносимое мероприятие\nстанет дочерним (вложенным)  мероприятием того, на которое оно было\nперенесено. Мероприятие, в которое будет вложено переносимое при операции\nпереноса (перетаскивания) будет выделено зелёным. Мероприятия, имеющие\nвложенные мероприятия, кроме того, выделяются жирным шрифтом.\nFigure 8.26. Arrangements with child arrangements\nFolding and unfolding project branches is performed by clicks on \"+\" and \"-\"\nbuttons to the left of the project name or by pressing keyboard buttons\n\"left arrow\" and \"right arrow\" or using \"Unfold\" context menu item which\nalso folds and unfolds project branches and arrangementa. Also, you can move\nbranches from one project to another by clicking context menu items \"Copy\"\nand \"Paste\" (a branch is copied with saving values of dependencies and\nterms) or \"Paste without assignee ones\" (a branch is copied without saving\nvalues of dependencies and terms).\nК поставленным мероприятиям можно добавлять комментарии. В комментариях\nможно кратко отчитываться о ходе выполнения того или иного мероприятия,\nпросматривать комментарии начальника и других исполнителей. Для того, чтобы\nпросмотреть/скрыть комментарии, нужно нажать на кнопку «Детали» на верхней\nпанели над проектом.  При этом, отобразится/скроется нижняя панель, на\nкоторой располагается область комментариев.\nFigure 8.27. Comment project arrangement\nДля того, чтобы добавить комментарий, в появившейся нижней панели нужно\nввести комментарий и нажать на галочку «Добавить» (илл.  «Комментарий к\nмероприятиям проекта») либо щелкнуть правой кнопкой мыши на мероприятие,\nвыбрать пункт меню «Комментарии», далее «Добавить». В появившемся окне нужно\nввести комментарий и нажать на кнопку «Cохранить» (илл. «Добавление\nкомментария;»).\nFigure 8.28. Adding comment;",
    "Assessment and registration\nOne of ways to fix completion of arrangement works is setting progress\nvalue. The project author or a person with access to editing project, can\nset total work progress for project and its arrangements. The data are not\ndisplayed and do not influence progress values entered by assignee persons\nin the \"Work flows\" module.\nFigure 8.29. Setting progress\nIn \"Progress\" line corresponding to the surname of the assignee person by\nclicking arrangement with left button progress can be indicated for the\nassignee person in percents. Changes are applied by clicking \"Save\" button\nand canceled by clicking \"Cancel\" button. Green color indicates that there\nis sufficient time for performing assignment. After deadline is missed,\ncolor is changed to red.\nВ любой момент можно изменить время выполнения задания, формулировку, выбрав\nпункт в контекстном меню \" Изменить…\" либо два раза кликнуть по самому\nмероприятию.\nYou can delete an arrangement by selecting \"Delete\" context menu item. After\nthat, the arrangement name will be stricken out and after page updates, it\nwill not be listed.\nA project is considered completed and is hidden in project list if all\narrangements of project are set as 100% completed by the author. The\nprogress of work completed can be set by the author only; and progress set\nby an executor is only for information purposes and do not complete work\neven if an executor sets project as 100% completed.",
    "Project search\nДля поиска информации необходимо в поле“Поиск информации”ввести ключевые слова поиска и нажать Enter.  Выдача результатов поиска\nзависит от выбранного элемента в навигаторе.\nIf the root element in tree of portfolios is selected, the search string is\nmatched against:\nвсех имён портфелей, входящих в общекорпоративное дерево портфелей;\nвсех имён проектов, входящих в портфели в общекорпоративном дереве;\nвсех имён и всего содержимого файлов, находящихся в папках проектов\nобщекорпоративного дерева.\nIf a portfolio in corporate tree of portfolios is selected, the search\nstring is matched against:\nвсех имён портфелей, входящих в выбранный портфель;\nвсех имён проектов, входящих в выбранный портфель и вложенные портфели;\nвсех имён и всего содержимого файлов, находящихся в папках проектов,\nвходящих в выбранный портфель и вложенные портфели.\nIf a project in corporate tree of portfolios, \"Favourites\" or \"My projects\"\nsection is selected, the search string is matched against:\nвсех имён мероприятий, входящих в выбранный проект;\nвсех имён и всего содержимого файлов, находящихся в папке проекта;\nвсех имён и всего содержимого файлов, находящихся в папках работ,\nсоответствующих мероприятиям проекта.\nIf \"Favourites\" or \"My projects\" section is selected, the search string is\nmatched against:\nвсех имён проектов, находящихся в разделе;\nвсех имён и всего содержимого файлов, находящихся в папках проектов,\nнаходящихся в разделе.\nВ поиске доступна возможность просмотра завершенных и удаленных проектов,\nтакже восстановление удаленного проекта. Для просмотра ранее выполненных и\nудаленных проектов нужно выделить в результатах поиска «Проекты» и в\nпоявившихся дополнительных полях поиска поставить галочки для выбора периода\nи поиска в завершенных и удаленных проектов. После чего нажать кнопку в\nосновой рабочей области. Для восстановления удаленного проекта нужно выбрать\nего и на любом из пунктов удаленного мероприятия вызвать контекстное меню,\nгде нужно выбрать пункт меню «Восстановить». Далее указать расположение\nвосстановленного проекта в портфеле проектов и нажать кнопку\n«Выбрать». Восстановленный проект отобразится в навигаторе, в указанном\nпортфеле.\nFigure 8.30. Project search",
    "Project reports\nВ модуле «Проекты» предусмотрена возможность формирования нескольких видов\nотчётов. Для того, чтобы сформировать любой из отчетов, необходимо в\nконтекстном меню проекта (либо его ветки)  выбрать соответствующий пункт:\nExcel export\nXML export\nPrint version (table);\nPrint version (diagram);\nTotal project work report.\nExcel and XML report\nIn forming of theses reports, xls and xml files are downloaded to local\ncomputer, correspondingly. Excel report includes the following information:\ncode, name of arrangement, progress, deadline, remaining/overdue, executor.\nFigure 8.31. Excel report\nFigure 8.32. XML report\nGraphic version of project\nSome parameters of the report can be set in window, which opens during\nforming the type of report:\nFigure 8.33. Diagram report\nThe title of the report is set as \"Calendar schedule of project\n\"PROJECTNAME\"\".\nSlider at the top of the window changes diagram scale; the leftmost position\ndisplays diagram with the most minimal scale, and the rightmost, in the most\nmaximal scale.\nLine denoting an arrangement on the diagram, black color is the current\ntotal execution progress.\nThe bottom part of the window shows check box \"Add signature\" to select a\nperson whose signature will be shown in the report. In order to do this,\ncheck the check box, click a button with ellipsis and add the required\nemployee. The final report will show, apart from the full name of the\nselected employee, the position.\nAfter you set all parameters, click \"Print\" button.\nPrint (table) version\nIt is also referred to as project protocol. As for \"Diagram\", when forming\nthe type of report you can set some parameters: number of reported comments\nto the project arrangements:\nFigure 8.34. Report as table\nAfter you set all parameters, click \"Print\" button. Since the report is\nusually larger by height than by width, you should scroll the report down to\nsee \"Print\" and \"Cancel\" buttons.\nCommon report for project arrangements\nDoes not have any transmitted stages of forming and is designed to obtain\njoint statistics on project-related arrangements.\nFigure 8.35. Common report for project arrangements",
    "Chapter 9. \"Objectives and indicators\" module\nРевизия VCS: 3c3e04345\nДата сборки документа: \n\t\t\t\t\t2023.11.09 17:03:53\nTable of Contents\nThe module is designed to monitor progress in achieving strategic objectives\nof the company and to assess them. The module allows to formulate and to\ndecompose strategic objectives of company, to form arbitrary maps of\nindicators, to make dictionary of indicators, and to input indicator values.\nThe module includes two main parts:\nStrategy\nMeasures\nStrategy\nПункт «Стратегия» модуля «Цели и показатели» предназначен для визуального\nотображения связи целей с показателями целей.  Позволяет отобразить прогресс\nдостижения целей и связанных с ней объектов (маршруты, проекты, портфели\nпроектов).\nДля просмотра связанных с целью объектов на карте показателей, на которой\nрасположена цель, нужно кликнуть на текущее значение показателя цели,\nнапример , которое является текущим значением цели «Повысить уровень\nорганизационно-пропагандистской деятельности Фонда» (см. илл. «Связь целей с\nпортфелями и маршрутами»). В появившемся окне отображаются портфели, проекты\nи маршруты, связанные с целью. Напротив каждого из связанных объектов\nрасположена кнопка «подробнее», по нажатию кнопки происходит редирект на\nсвязанный объект.\nFigure 9.1. Link between objectives, portfolios and routes\nYou can connect objectives to indicators directly on main working space of\n\"Objectives and indicators\" module. In order to do this, you have to first\nlocate objective and indicator and then connect them by dragging mouse and\npressed Ctrl button.\nЗамечание\nIf you delete any of connected object, a link is also deleted\n(Goat-Portfolio, Objective-Project, etc.).\nТакже в этом разделе можно добавлять“Подписи”и“Реестры”. «Подпись» представляет собой поле для ввода\nтекста. Для ввода текста необходимо вызвать контекстное меню и выбрать пункт\n«Изменить». В открывшемся HTD-редакторе необходимо ввести текст и\nсохранить.Введенный текст можно перемещать по рабочей области с помощью\nмышки. Также можно создать ссылку на этом тексте. Для этого, снова вызываем\nконтекстное меню кнопки и выбираем пункт «Свойства», активируем галочку\n«Вставить ссылку» и в поле вносим ссылку и сохраняем. Теперь при нажатии на\nтекст, мы будем переходить по указанной ссылке.\n\"Registries\" is designed to display registry items as a table with columns\nas values of selected registry fields.",
    "Measures\nIt is designed to assess results of achieving objectives. Values of the\ncompany strategic objectives are included in the indicator list.",
    "Indicator control panel\nПанель управления показателями состоит из двух частей - стек-панель (слева в\nобласти навигатора) и основная рабочая область\n(справа). См. илл. «Управление показателями». На стек-панели, в зависимости\nот вашего уровня доступа, находятся несколько вложенных панелей из списка:\n«Стратегия» (стратегические карты показателей), «Справочник показателей» и\n«Ввод показателей».\nFigure 9.2. Indicator control\n\"Indicator map\" panel\nStrategy is a root element of indicator map and in the navigator window on\nthe left it can include any hierarchical structure of strategic maps, which\nis individually designed by each company.\nНовая карта показателей создаётся с помощью кнопки«Создать». Для создания новой карты необходимо её\nназвать, выбрать фон и сохранить текущие параметры. Созданная карта станет\nоснованием для декомпозиции стратегических целей организации. Для просмотра\nкарты за определённый день нужно воспользоваться кнопкой «Выбрать дату»\nрядом с датой на правом верхнем углу. При выборе карты за период,\nотображается тренд показателя по сравнению с текущим и текущее значение.\nДля добавления цели на созданную карту нужно нажать кнопку «Цель» на панели\nсверху и в появившемся окне выбрать цель из списка либо создать новую цель с\nпомощью кнопки «+». При создании новой цели единственным обязательным для\nзаполнения является поле «Формулировка цели», к цели можно привязать\nнесколько показателей с обязательным выделением целевого показателя\n(см. илл. «Окно добавления новой цели»).\nВ основной рабочей области (справа от окна навигатора) это выглядит как\nцветное графическое представление значений показателей, настроенное\nпользователем. Может быть представлен в виде разных индикаторов (спидометра,\nполуспидометра, слайдера, графика, светофора и семафор (односекционный\nсветофор)) в зависимости от индивидуальных настроек пользователя. На карту\nпоказателей можно добавить элементы текста с возможностью форматировать\nстиль и шрифты текста. Текущую карту показателей можно распечатать с помощью\nкнопки с изображением принтера в правом верхнем углу. В качестве версии для\nпечати на компьютер пользователя скачивается текущая карта в формате *png.\nFigure 9.3. Adding new objective window\n\"Indicator dictionary\" panel\nПредназначен для редактирования справочника показателей.  Доступен только\nдля пользователей, в обязанности которых входит редактирование данного\nсправочника.\nСправочник показателей доступен для редактирования специально определенным\nсотрудникам компании. Показатели, включенные в справочник показателей,\nделятся на результирующие и формирующие и внешние. Результирующие показатели\nвычисляются на основе формирующих согласно формулам, заданным\nпользователем. Формирующие показатели вводятся в систему пользователями,\nответственными за их ввод.“Внешние”показатели не требуют\nназначенияответственного за ввод показателя, настройки периода обновления,\nспособа ввода значения и значения по-умолчанию.\nOther indicators not included in the dictionary can be used for assessment\nof separately set objectives and are meaningless after the objective is\nachieved (\"Free indicators\"). Values of such indicators are entered to the\nSystem manually by the specially assigned users.\n\"Indicator input\" panel\nTo input values of indicators for which user is assignee.",
    "Viewing, creating, editing and deleting dictionary indicators\nTo view indicators, select module \"Objectives and indicators\" and select in\nthe navigator window \"Indicator dictionary\". The dictionary includes two\ngroups of indicators - \"Base\" and \"calculable\". Select necessary group to\ndisplay corresponding indicators in the main working area.\nIn order to view list of objectives which are assessed by indicators click\n\"+\" button on the left of the indicator name. Afterwards, list of objectives\nincluding executor, position of executor, and name of structure division is\nshown below the name of indicator.\nCreating indicator\nNew indicator for dictionary can be created only by users with\nresponsibility for managing the dictionary.\nДля того, чтобы создать показатель, нажмите на кнопку добавления нового\nпоказателя «+», расположенную в левой части заголовка панели просмотра\nпоказателей из справочника (см. илл.  «Справочник показателей»).\nFigure 9.4. Indicator dictionary\nFigures below display panels for creating foundation (baseline) and\ncalculable (resulting) indicators.\nFigure 9.5. Создание/редактирование формирующего (базового)  показателя\nFigure 9.6. Создание/редактирование результирующего (рассчитываемого)  показателя\nFigure 9.7. Creating/editing external indicators\nTo create baseline indicator, enter name of indicator, unit of measurement,\ndictionary of indicator values, assignee for its input, periodicity of\nupdating values, default value, code (the field is not obligatory, but it\nhas to be entered if the field is planned to be used in a calculation of\nother parameters), select type of indicator and border values for the\nindicator.\nTo create calculable indicator, enter name of indicator, unit of\nmeasurement, formula to calculate indicator value, code, and select type of\nindicator. The formula is an arbitrary arithmetic expression including codes\nof indicators, operations of adding \"+\", subtraction \"-\", multiplication\n\"*\", division \"/\" and brackets to indicate priority of operation.\nTo create external indicator, enter name of indicator, unit of measurement,\nselect type of indicator (external), enter border values, and save.\nТакже с помошью кнопки“Сохранить как шаблон”есть возможность\nсохранить предварительные настройки показателя.\nMeasures can be grouped in arbitrary groups. One indicator can be included\nin one group only. Folding and unfolding groups can be done by clicking \"+\"\n(plus) and \"-\" (minus) buttons right to the group names. A user who is\nassignee for their editing they are displayed as a group on a single page.\nКод показателей, участвующих в расчете формул, может быть введен вручную или\nнайден в справочнике с помощью специального диалогового окна\n(см. илл. «Выбор кода показателя»), открывающегося при нажатии на кнопку\n«». Здесь пользователь может найти необходимый показатель, используя\nпараметры поиска:\nType of indicator\nText search in indicator name\nFigure 9.8. Selection of indicator code\nДля того, чтобы вставить код показателя в текстовое поле, необходимо\nвыделить его в списке и нажать на кнопку «Выбрать».  Для результирующего\nпоказателя поле «Код» также может быть не заполнено, если не планируется\nиспользовать его в дальнейшем при расчете других показателей. После ввода\nданных для создания показателя нажмите на кнопку «Сохранить». Если во\nвведённых данных была обнаружена ошибка, система сообщит вам об этом.\nЗамечание\nСправочник автоматически генерируемых системных показателей (см. ).\nEditing indicators\nДля того, чтобы изменить параметры показателя, необходимо нажать на кнопку\nредактирования в соответствующей показателю строке.  При этом появится\nпанель для редактирования, соответствующая типу показателя (аналогично\nсозданию показателя, рисунки илл.  «Создание/редактирование формирующего\n(базового) показателя» и илл. «Создание/редактирование результирующего\n(рассчитываемого)  показателя»).\nRules and methods for editing indicators are the same as for creating them\n(see \"Creating indicator\" section). In order to save the values input click\n\"Save\" button.\nDeleting indicators\nA user with authorities for managing indicator dictionary is able to delete\nindicators. In order to delete an indicator, click delete button in the line\ncorresponding to the indicator. The System will ask for a confirmation of\ndeleting the indicator; if a user agrees to, the indicator will be deleted\nand the indicator list will be updated.\nНевозможно удаление показателей, используемых для оценки целей, как\nнепосредственно, так и в составе других (результирующих)  показателей.\nViewing updatable indicators\nA user can view a list of the indicators he or she updated by unfolding\n\"Value input\" tab in the navigator window on the left of \"Objectives and\nindicators\" panel. The panel has a list of folded panels, each of  which\ncorrespond to an indicator. If a user selects any of them, main working area\ndisplays a table with indicator values (by default for the last month).\nIn order to view list of objectives which are assessed by indicators click\n\"+\" button on the left of the indicator name. Afterwards, list of objectives\nincluding executor, position of executor, and name of structure division is\nshown below the name of indicator.\nEach indicator panel in stack panel has icon showing time before its\nupdate. The icons can be of the four types:\nThere is no requirement to enter value for the indicator in the near future;\nYou have to input value for the indicator today;\nInput of value for the indicator is overdue.",
    "Indicator value input\nThe values are input as follows:\nAdding new value for an indicator\nДля того, чтобы ввести новое значение показателя, необходимо в области\nнавигатора перейти на панель «Ввод показателей» и в основной рабочей области\nсправа отобразится страница ввода показателей, где нужно нажать на кнопку\n«Добавить значение», расположенную справа от названия показателя. Система\nпредоставляет пользователю окно для ввода нового значения (см.  илл. «Ввод\nнового значения показателя»).\nFigure 9.9. Inputting new indicator value\nIn order to save the value you entered click \"Save\" button. Value input for\nindicators is available for authorized users only. The value is input\ninstantly for all indicators of one group of one user.\nValue input page display borderline, maximal and minimal values for each\nindicator. If the value entered for an indicator is outside of acceptable\nrange, the value input field is highlighted by red color.\nChanging indicator value\nИзменение значений показателей происходит с помощью окна, изображенного на\nрисунке илл. «Окно для изменения значения показателя». Для того, чтобы\nизменить значение, необходимо нажать на кнопку редактирования «»,\nрасположенную в соответствующей строке на панели ввода значений показателей.\nFigure 9.10. Window to change indicator value\nA user enters new value and click \"Save\" button.\nDeleting indicator values\nFunction to delete indicator value is also available on the indicator value\ninput panel.\nFigure 9.11. Panel to input/delete indicator values\nДля того, чтобы удалить значение нужно нажать на кнопку «», расположенную в\nсоответствующей строке на панели ввода значений показателей.",
    "Приложение: Автоматически генерируемые системные показатели\nEff [Имя_пользователя, название_подразделения]\n[значение]_eff\nЭффективность пользователя и подразделения\nWorkload [Имя_пользователя, название_подразделения]\n[значение]_workload\nНагрузка пользователя и подразделения\nОтклонение в днях от базового плана [Название_проекта]\n[значение]_deviation\nОтклонение в днях от базового проекта\nПлановая стоимость [Название_портфеля_проекта]\n[значение]_cost_expected\nПлановая стоимость портфеля проекта\nПлановая стоимость [Название_проекта]\n[значение]_cost_expected\nПлановая стоимость проекта\nПроцент выполнения плана [Название_проекта]\n[значение]_percent\nПроцент выполнения проекта\nПроцент выполнения планов в портфеле [Название_портфеля_проекта]\n[значение]_portfolio_percent\nПроцент выпонения портфеля проекта\nФактическая стоимость [Название_портфеля_проекта]\n[значение]_cost_fact\nФактическая стоимость портфеля проекта\nФактическая стоимость [Название_проекта]\n[значение]_cost_fact\nФактическая стоимость проекта\nКоличество завершенных процессов за неделю по маршруту [Название_маршрута]\n[значение]_finishedcountweek\nКоличество завершенных маршрутов за неделю\nКоличество запущенных процессов по маршруту [Название_маршрута]\n[значение]_activecount\nКоличество запущенных маршрутов\nСредняя продолжительность процесса за неделю по маршруту [Название_маршрута]\n[значение]_avgdurationweek\nСредняя продолжительность за неделю по маршруту",
    "Chapter 10. Employees Module\nРевизия VCS: 3c3e04345\nДата сборки документа: \n\t\t\t\t\t2023.11.09 17:03:53\nTable of Contents\nOrganization structure\nOrganization structure includes five sections:\nWork schedule\nProfile\nDaily planner\nWork\nReports\nAdministration\nWork schedule\nSchedule allows review of workload for all employees on the same position or\nin one structural subdivision. Employee work schedule displays presence and\nstatus of works (completed or not completed) of subordinated employees in a\nperiod of time. Apart from showing by day and week, schedule allows managing\njobs of employees: to create and to edit terms and assignee.\nFigure 10.1. График работ(в режиме“День”)\nFigure 10.2. График работ(в режиме“Неделя”)\nПо умолчанию график отображает работы в режиме“День”, с\nвозможностью переключения между режимами“День”/“Неделя”. Слева в графике отображаются\nФ.И.О. сотрудников выбранного подразделения или должности. Под графиком\nрасположен таймлайн с возможностью перехода вперед-назад по дням(неделям) и\nвыбором дня или недели из календаря. Работы на графике отображаются как\nпрямоугольники желтых(для невыполненных работ), зеленых(для выполненных\nработ)  и составных(для индикации присутствия нескольких работ в одном и том\nже временном промежутке) цветов.\nСоздать новую работу можно одинарным нажатием по любой пустой“клетке”на графике. Для редактирования сроков и перемещения\nдостаточно захватить мышью нужную работу и переместить ее или растянуть\nвдоль временной оси. Если у пользователя происходит наложение нескольких\nработ по времени, то они“сворачиваются”в особый блок. Для\nтого чтобы отредактировать работу, необходимо вызвать контекстное меню\nнажатием правой кнопки мыши по работе.\nProfile\nПрофили сотрудников отражают занятость сотрудников по их записям в\nежедневнике и загруженность в соответствии с выставленными работами. Помимо\nэтого, в профилях содержится информация о навыках и умениях, опыт работы и\nобразование, интересы и взгяды, желания и личные цели, реквизиты и контакты\nсотрудника (см. илл.  «Профиль сотрудника»). У сотрудников отдела кадров\nприсутствует раздел «Личное дело».\nFigure 10.3. Employee profile\nДля просмотра информации о сотруднике, его необходимо выбрать в дереве\nорганизационной структуры предприятия (в области навигатора) либо найти с\nпомощью контекстного поиска (на верхней панеле) путём введения в поле «Поиск\nинформации» фамилии или имени сотрудника. При введении первых букв фамилии\nили имени сотрудника появляется список пользователей, удовлетворяющих\nкритерию поиска. Формат отображения ФИО пользователей настраивается\nметодологом системы и может быть представлен в одном из видов - полное\n(Фамилия Имя Отчество), либо краткое (Фамилия И.О.). В правой части области\nпросмотра, ниже фотографии сотрудника располагаются кнопки для просмотра\nдополнительной информации о нём:\nEvents and load — shows work schedule and load for the employee;\nSkills and abilities — shows information on skills and abilities of the\nemployee;\nWork experience and education — shows information on education of the\nemployee including education institution graduation date and number of\ndiploma, and information on previous work experience;\nPersonal interests and views — show information on personal interests and\nviews of the employee;\nContacts — shows identification data and contacts of the employee. By\ndefault, contacts are displayed below selection buttons of displayed\nsection.\nPersonnell file is a set of folders and sub-folders which contains personal\ndossiers of the employees.\nFigure 10.4. Personnell file\nContext menu of files in personnell files of employees include the following\nitems:\nNew version;\nDownload;\nRename;\nMove;\nSend by e-mail;\nDelete.\nDaily planner\nUsing the section, a manager can review daily planners of his or her\nemployees and set notes for them.\nFigure 10.5. Daily planners of employees\nThe page displays notes for the selected employee as a table (by default for\nthe current week) and the following buttons:\nдля изменения периода просмотра ежедневника подчиненного «»;\nдля получения печатной версии ежедневника подчиненного за выбранный\nпромежуток времени «».\nWork\nIn this section a manager is able to review and set jobs for employees.\nFigure 10.6. Works of employee\nДля работ, в которых пользователь является автором, возможно их завершение\nгалочкой любым из его вышестоящих руководителей, а также пользователями с\nделегированным правом «Изменение статуса» от любого из его руководителей.\nКроме того, только для включенной опции в Конфигураторе“Разрешать\nзавершать работы подчиненных, в которых он является ответственным”для работ, в которых пользователь является ответственным, возможно их\nзавершение галочкой любым из его вышестоящих руководителей, а также\nпользователями с делегированным правом «Изменение статуса» от любого из его\nруководителей.\nВ обоих случаях в поле «Завершил» хода выполнения документа отображается\nпользователь(-и) согласно настройке Конфигуратора «Формат отображения поля\nавтора в ходе выполнения».\nДля просмотра завершенных работ, работ за определенный период, а также для\nпоиска работ (по названию, автору и исполнителю), необходимо открыть\nпараметры поиска.\nFigure 10.7. Search parameters\nДля поиска работ по названию, автору и исполнителю, необходимо в поле поиска\nввести ключевые слова и нажать“Enter”.  Поиск будет\nпроизводится в выделенном фильтре или подфильтре.  Для поиска работ за\nпериод, в поисковом фильте необходимо указать определенный или произвольный\nпериод, а также для отображения удаленных и завершенных работ нужно\nпоставить галочку в чекбоксе.\nReports\nIn the section a manger is able to control efficiency and work load of\nemployees.\nFigure 10.8. Reports\nAdministration\nВ разделе «Администрирование» есть возможность редактировать организационную\nструктуру (создание и редактирование подразделений и всех их атрибутов,\nсоздание и редактирование должностей, просмотр и редактирование карточек\nподразделений, должностей и пользователей), назначать и увольнять с\nдолжности сотрудников. У сотрудника отдела кадров есть возможность создания\nучетной записи пользователей непосредственно при назначении пользователя на\nдолжность (пароль и логин задает Администратор Системы), а также назначать\nна должность пользователя из списка имеющихся учетных записей. Также\nсотрудник отдела кадров может редактировать фотографию пользователей.\nFigure 10.9. Administration\nTo add new division, select a division in the navigator and click \"Add\nsubdivision\" in the main working area or in pop-up menu oа the \"Create\"\nbutton.\nFigure 10.10. Add division\nTo add new division, you have to fill in the following fields:\nName of subdivision (in three languages);\nNumber;\nCode of subdivision (filled automatically);\nSelect parent division;\nName of position of the head of division (in three languages);\nSelect the head from organization structure or create new user (optional\ninput field);\nSelect acting head from organization structure;\nIf required, add deputy head (by clicking \"Add\" button):\nName of position for deputy head (in three languages);\nSelect employee from organization structure;\nSelect division.\nКроме этого, если настроены карточки подразделения, то можно внести либо\nотредактировать в них значения.\nTo save entered changes, complete required fields and click \"Save\" button;\nto cancel click \"Cancel\" button. In order to edit a division, select it in\nthe division navigator on the left, and click \"Edit division\" button in the\nmain working area.\nTo add new position, select a division in the division navigator on the\nleft, and click \"Add position\" button in the main working area or item menu\nin the menu of the \"Create\" button.\nFigure 10.11. Adding position\nTo create new position, the following fields must be filled:\nName of position (in three languages);\nCode (completed automatically);\nKey;\nRequired number of staff for the position.\nКроме этого, если настроены карточки должности, то можно внести либо\nотредактировать в них значения.\nTo save entered changes, complete required fields and click \"Save\" button;\nto cancel click \"Cancel\" button. In order to edit a position, select it in\nthe division navigator on the left, and click \"Edit\" button.\nYou can apppoint a position to an employee in two ways:\nСоздать сотрудника - при выделенном в навигаторе должности, в основной\nрабочей области либо в пункте меню кнопки «Создать», выбрать «Создать\nсотрудника»;\nВыбрать из справочника - при выделенном в навигаторе должности, в основной\nрабочей области либо в пункте меню кнопки «Создать», выбрать «Выбрать из\nсправочника».\nFigure 10.12. Create a new user\nTo create a new employee, fill the following fields in:\nFull name;\nCode;\nE-mail;\nJID;\nнеобходимые права доступа и роли.\nПримечание:роль“Сотрудник отдела кадров”можно назначать только на те дочерние подразделения, в родительском\nподразделении которого редактирующий пользователь сам является сотрудником\nотдела кадров.\nПосле заполнения всех необходимых полей, для сохранения внесенных изменении,\nнужно нажать кнопку «Сохранить», для отмены кнопку «Отмена». Для того, чтобы\nредактировать данные сорудника, нужно выделить его в навигаторе. Для\nдобавления фотографии в профиле сотрудника нужно навести указатель мыши на\nобласть изображения и выбрать пункт“Изменить изображение”.\nДля удаления фотографии нужно выбрать пункт“Удалить\nизображение”и подтвердить дейстие. Сотрудник отдела кадров может\nредактировать только фотографий пользователей подразделений оргструктуры, к\nкоторому он принадлежит.\nFigure 10.13. Select from the list\nДля выбора сотрудника из справочника можно найти его в списке либо\nвоспользоваться поиском: ввести в поле поиска фамилию пользователя и нажать\nEnter. В списке необходимо выделить нужного сотрудника и нажать кнопку\n«Назначить», для отмены кнопку «Отменить». Для увольнения сотрудника с\nдолжности необходимо нажать кнопку справа от фамилии сотрудника.",
    "Reserve\nДля сотрудников отдела кадров доступен раздел «Резерв», в котором\nотображаются пользователи не назначенные ни на какую должность.  Для вызова\nдиалога создания новой учётной записи пользователя нужно нажать кнопку\n«Создать». Каждый пользователь в списке кадрового резерва имеет статус -\n«активен».\nFigure 10.14. Reserve\nDouble click a specific user entry (to change it), the main area displays:\n\"Administrating\" section with editing main data for user: full name, e-mail,\netc.\nРаздел «Профиль» с отображением всех подразделов и всеми возможностями по\nманипуляциям с ними (заполнение карточек, загрузка файлов в личное дело,\nредактирование фотографий и т.  д).\nFigure 10.15. Profile/Administrating sections for an employee from reserve",
    "Address book\nРаздел“Адресная книга”предназначен для добавления, просмотра\nи поиска контактных данных пользователей и организаций.  Для просмотра\nадресной книги необходимо нажать на кнопку“Адресная книга”,\nкоторая расположена в самом низу в навигаторе (см. илл. «Адресная\nкнига»). После нажатия на кнопку в основном окне по умолчанию отображается\nсписок контактов.\nFigure 10.16. Address book\nThere are two modes of display:\ndisplay of contact list;\ndisplay of enterprise list.\nПереход между режимами осуществляется с помощью кнопок“Люди”и“Организации”на панели сверху.\nContact entry contains the following information:\nphotograph of contact;\nfull name;\ncontact access;\ndate of birth;\npostal address;\nphones (work, home, mobile, personal, other);\ne-mail addresses (home, work, other);\nIM addresses (icq, skype, xmpp, other);\nURL of home page (can be several);\nplace of work and position;\nnotes;\ntags.\nEnterprise entry contains the following information:\nlogo of enterprise;\nname of enterprise;\nweb site of enterprise;\naddresses of enterprise (judicial and actual);\ncontact data (phone(s), fax(es), e-mail(s));\nemployee of enterprise (link to the employee entry).\nПри повторном вводе данных о контакте/организации Система выдаст\nпредупреждающее сообщение о наличии таких данных в адресной книге.  Вы\nможете нажать кнопку“Продолжить”, тогда система сохранит\nданные о новом контакте. Для возвращения в режим редактирования карточки\nконтакта/организации, нужно нажать кнопку“Исправить”.",
    "Chapter 11. \"Settings\" module\nРевизия VCS: 3c3e04345\nДата сборки документа: \n\t\t\t\t\t2023.11.09 17:03:53\nTable of Contents\nThe System gives its users opportunity to edit settings for the whole user\nsubsystem independently. The function is active at click on the \"Settings\"\nbutton in the top right corner of the main working place. The button click\nopens three main tabs:\nGeneral - personal data settings (system authorization parameters, mail\nclient, IM notifications), module settings and delegating (allows transfer\nof the rights to other user of the System selectively).\nNotifications - settings of types of system notifications on new events that\nthe user wishes to receive.\nRoutes - settings to create and save routes used by users.\nGeneral settings\nВ данной вкладке настраиваются параметры для управления модулями, параметры\nавторизации пользователя в системе, почтовый клиент, IM (джаббер для обмена\nмгновенными сообщениями) и настройки делегирования полномочий в системе.\nFigure 11.1. User settings, \"General\" tab\nУправление модулями позволяет при необходимости отключать отображаемые\nмодули (в т.ч. внешние). Также есть возможность выбора отображаемого при\nвходе в систему модуля по умолчанию, настройка автообновления данных,“мигания”при наличии обновлений и вид отображения документов в\nХранилище.\nВ разделе“Параметры авторизации”пользователь может изменить\nпараметры авторизации (логин/пароль) и продолжительность сессии в минутах.\nРаздел“Мобильное приложение”включает в себя настройку\nотправки уведомления с ссылками для скачивания мобильной версии ARTA\nSynergy, а также QR-код с параметрами доступа для авторизации в мобильном\nприложении.\nДелегирование позволяет выборочно передать полномочия пользователя другому\nпользователю системы. Делегировать полномочия можно только вниз по\nдолжностной иерархии, т.е. нельзя передать свои права лицу с равнозначной\nдолжностью либо с должностью выше делегирующего свои\nполномочия. Делегирование разделено на три типа (см. илл.  «Пользовательские\nнастройки, вкладка «Общие»»):\nВaily planner — view, status edit, edit, create, delete assignments;\nWorks — create, agree/review, assign, change progress, change status, edit,\ndelete, remove. Right to review works gives the right to comment them;\nProjects — review, comment, assign assignee persons, edit;\nКнопка со знаком «+» предназначена для вызова окна выбора сотрудника,\nкоторому будут делегированы (переданы) полномочия. Это окно стандартно для\nСистемы и было описано выше. В этом окне имеется поле поиска, позволяющее\nвыполнить поиск сотрудников по ключевым буквам имени или фамилии. Также\nздесь можно выбрать уровни структуры и рабочие группы пользователей. После\nвыделения сотрудника и нажатия кнопки «Выбрать» открывается окно выбора типа\nпередаваемых полномочий.Здесь следует отметить галочкой нужные.\nНиже панели делегирования располагается раздел, в котором можно настроить\nпросмотр файлов и документов, а также переключаться между тёмной и светлой\nтемами оформления интерфейса Системы.\nНа электронный почтовый адрес и/или jabber ID, указанные во вкладках“Электронная почта”и“Обмен сообщениями”, будут\nприходить уведомления о новых событиях в Системе. Данные вкладки могут\nотсутствовать, в зависимости от настроек Системы.\n\"Save\" button saves changes to the System. After saving, settings window\ndisplays information box with name of the person who was delegated rights\nand list of delegated rights. Also, a button with ellipsis to show delegated\nrights editor dialog and a button to cancel all delegated rights on an\nemployee are shown.\nПосле того, как права делегированы, на почту пользователя, которому права\nбыли делегированы, придет об этом уведомление.  После этот пользователь\nдолжен зайти под своим логином и паролем, перейти в модуль «Сотрудники» и\nтам, смотря на что ему были переданы права, он может увидеть Ежедневник,\nРаботы и Проекты пользователей. И дальше в соответствии с новыми\nполномочиями этот пользователь может просматривать, удалять, редактировать,\nдобавлять работы (в зависимости от делегированных прав). Если пользователю\nделегировали права на создание работ/изменение статуса/удаление работ, то\nдействия будут производится от имени самого пользователя. В ходе выполнения\nпод именем делегировавшего права пользователя указывается имя пользователя,\nфактически совершившего действие, в формате:“Исп.: ФИО”.\nFigure 11.2. Progress of execution\nDelegating examples\nLet us consider two scenarios:\nThe head of an enterprise because of lack of time wants to delegate rights\nto control progress to a department head of the company, but in such a way\nthat he is not able to perform any other actions except for\ncontrol. I.e. the head wants that an employee is able to set progress for\nother employees and complete assignments, but is not able to create new\nassignments, delete them or reassign. In order to do so:\nThe head logs in to the system under his account;\nClick \"Settings\" button;\nIn the opened window click \"Delegate\" button next to \"Works\";\nIn the opened window \"User selection\" check check box to select a division\nfor search;\nSelect the subdivision whose head will be delegated rights;\nClick \"Search\" button;\nAfter that list of employees of the division including the manager of the\ndivision will open;\nSelect the manager of the division and click \"Select\";\nIn the window opened check \"Change progress percentage\" and \"Change status\";\nClick \"Save button\".\nThe head of the enterprise has an assistant who collects progress\nreports. The assistant needs rights to add comments. In order to do this,\nperform the following actions:\nThe head logs in to the system under his account;\nClick \"Settings\" button;\nIn the opened window click delegating button related to \"P\";\nIn the opened window \"User selection\" check check box to select a division\nfor search;\nSelect the subdivision whose head will be delegated rights;\nClick \"Search\" button;\nAfter that list of employees of the division including the manager of the\ndivision will open;\nSelect the manager of the division and click \"Select\";\nВ появившемся окне не устанавливать галочку (т.к. если кнопка «Просмотр»\nактивна, то это даст полномочия и на работу с комментариями.);\nClick \"Save button\".",
    "Notification settings\nNotification settings are located at a separate tab and are divided into\nfive categories:\nDaily planner\nWork flows\nПроекты\nЦели и показатели\nOther\nFigure 11.3. User settings, \"Notifications\" tab\nВ каждой из категорий галочками указывается, какие типы уведомлений,\nотносящихся к той или иной категории, пользователь хочет получать.\nУведомления могут приходить:\nна настроенный e-mail пользователя;\nна запущенный десктопный клиент, в котором авторизован пользователь;\nна установленное мобильное приложение под управлением Android / iOS.\nВ уведомлениях указывается инициатор события, описание события, дата, период\nисполнения или другие данные, относящиеся к этому событию. В уведомлениях по\nработам содержится ссылка, которая открывает документ соответствующей\nработы.\nПри переходе по ссылке на документ системы из e-mail уведомлений и\nуведомлений десктопного клиента и последующей успешной авторизации, система\nдолжна перенаправлять пользователя к объекту из исходной ссылки.\nПримечание\nВ случае, если ссылка в уведомлениях не рабочая, следует обратиться к\nадминистратору системы (требуется дополнительная настройка URL-приложения).",
    "Route settings\nThe tab allows editing user route settings. A user can create tree of routes\ngrouped by sense.\nFigure 11.4. User settings, \"Routes\" tab\nFrequently used routes can be added to favourites. After that, these routes\nwill be available in new work creating dialog at the \"Work flow\" section.\nДля добавления маршрута в список избранных нужно воспользоваться значком\nзвезды рядом с названием каждого маршрута (см. илл.  «Пользовательские\nнастройки, вкладка «Маршруты»»).\nTo edit a route, double click its name.\nTo create new route in route tree, select \"My routes\" item and click \"+\"\nbutton to open window where you can enter name of the route, level which\nwill be owner of the created route, and objective, which will be assigned to\nthe created route.",
    "Chapter 12. Instant messaging module\nРевизия VCS: 3c3e04345\nДата сборки документа: \n\t\t\t\t\t2023.11.09 17:03:54\nНа странице основного рабочего места (вне зависимости от активного на данный\nмомент модуля) в правом нижнем углу распологается значок вызова IM\nклиента. Щелчок на значок открывает основное окно клиента.  (илл. «Основное\nокно IM-клиента») Повторный щелчок скрывает основное окно IM клиента.\nВ случае, если клиент не настроен, в центре основного окна появляется\nсообщение «Приложение не настроено» и появляется кнопка «Настроить».\nClick \"Settings\" button to edit application settings. Enter your JID and\npassword in the opened dialog window.\nОкно диалога по умолчанию открывается слева от основного окна и всегда\nнаходится поверх основного интерфейса системы. (илл. «Окно диалога»)\nClick on a user in the list opens chat windo with the user. To send a\nmessage to a user, press Enter.\nДля добавления пользователя в контакт-лист нужно в окне чата нажать кнопку\n«Добавить контакт» . В появившемся окне ввести JID вида\nnick@jabber.server.name, имя и группу пользователя, нажать кнопку «ОК»\n(илл. «Добавление нового пользователя в контакт-лист»).\nПри запросе авторизации от неавторизованного пользователя появляется окно\nследующего вида:\nTo authorize user click button \"Accept\", or click button \"Cancel\" to cancel\nauthorization.\nПри нажатии на контакт правой кнопкой мыши появляется окно следующего вида:\n\"Change contact\" menu item allows editing data of the contact, \"Delete\ncontact\" items deletes the user from contact list, \"Unsubscribe user\" item\ncancels authorization of the selected user.",
    "Chapter 13. Справка\nРевизия VCS: 3c3e04345\nДата сборки документа: \n\t\t\t\t\t2023.11.09 17:03:54\nДанный подраздел предназначен для отображения справочной информации по\nтекущей версии ARTA Synergy. Содержит следующие вкладки:\nСправка - содержит в себе краткую информацию о текущем выбранном модуле.\nО программе - содержит ссылки на руководства пользователя / методолога /\nадминистратора согласно текущей итерации, а также ссылки на скачивание\nдесктопного клиента и пользовательского агента ARTA Synergy.\nЧто нового - отображает изменения Synergy в ходе последних трех обновлений.\nБыстрый старт.\nОтправить запрос - содержит форму для сообщений об ошибках или запросов на\nизменение функционала. Содержит следующие поля:\nТема\nФИО\ne-mail\nСообщение\nа также кнопку“Отправить”.\nПри первом входе в Систему после каждого обновления системы, при котором\nизменяется её версия (например, с 3.3 на 3.4), открывается справка с\nактивной вкладкой“Что нового”.",
    "Chapter 14. Attachments\nРевизия VCS: 3c3e04345\nДата сборки документа: \n\t\t\t\t\t2023.11.09 17:03:54\nTable of Contents\nРуководство по установке агента Synergy\nДистрибутив агента Synergy можно скачать из контекстной справки в разделе“О программе”. При этом для скачивания доступны три варианта:\nдляWindows, дляmacOSи дляLinux.\nУстановка в Windows\nДля установки агента Synergy в Windows необходимо запустить исполняемый\nпакет установки и следовать инструкциям установщика.  После установки\nнеобходимо проверить, что в файлеC:WindowsSystem32driversetchostsсодержится\nследующая строка (при необходимости, добавить её вручную):\nНа рабочем столе и в каталоге приложений появится ярлык для запуска агента\nSynergy.\nУстановка в macOS\nДля использования агента Synergy в macOS нужно запустить файлSynergyAgent.app. При этом может появиться запрос на\nоткрытие программы, загруженной из Интернета:\nFigure 14.1. Запрос на открытие приложения\nЧтобы внести заблокированную программу в список исключений, нужно нажать\nкнопку «Подтвердить вход» на панели «Общие» в разделе настроек «Защита и\nбезопасность», ввести пароль и нажать кнопку «Открыть»:\nFigure 14.2. Окно настроек Защита и безопасность\nЕсли при открытии выходит сообщение о повреждённом приложении,\nFigure 14.3. Сообщение о повреждении файла\nперейдите в терминал и введите следующую команду:\nУстановка в Linux\nАгент Synergy для Linux поставляется в виде исполняемогоjarфайла. Если у Вас правильно настроены файловые\nассоциации, то его можно запустить двойным кликом поjarфайлу. Если этого сделать не удается, агент можно\nзапустить из терминала, воспользовавшись командой:\njava -jar %путь/до/jar/файла.jar%\nЕсли необходимо, чтобыjarфайл запускался двойным\nнажатием, можно создать файл с содержимым:\njava -jar %путь/до/jar/файла.jar%\nи сделать его исполняемым с помощьюchmod:\nchmod +x %путь/до/папки/созданный_файл%\nТогда этот файл можно использовать для запуска пользовательского агента\nSynergy.\nПосле установки в файле/etc/hostsнеобходимо добавить следующую строку:\nУсловия работы агента Synergy\nДля того, чтобы установленный и настроенный пользовательский агент\nзапустился и работал, необходимо, чтобы в системе была установлена java не\nниже версии 1.7.0, причем для ОС Windows 32-битная. Иначе пользовательский\nагент не запустится с указанием ошибки, что не установлена требуемая версия.\nФункция сканирования в агенте Synergy работает только в ОС Windows.",
    "Руководство по установке модуля Arta Synergy в программе NCALayer\nСсылка для\nскачивания модуля версии 1.4\nСсылка для\nскачивания модуля версии 1.5\nУстановка NCALayer\nПрограмму NCALayer можно скачать по ссылкеhttps://pki.gov.kz/ncalayer/.\nПри этом для скачивания доступны варианты для следующих ОС: дляWindows, дляmacOSи дляLinux.\nУстановка модуля Arta Synergy\nДля установки модуля необходимо на рабочем столе и в каталоге приложений\nнажать правой кнопкой мыши на ярлык NCALayer и выбрать пункт «Управление\nмодулями».\nFigure 14.4. Модули NCALayer\nНеобходимо выставить флаг напротив модуля «Arta Synergy» и нажать кнопку\n«Установить модуль». Программа запросит разрешение на ее перезапуск.\nСведения для разработчика\nМодуль Arta Synergy «kz.arta.synergy.signmodule» поддерживает следующие\nметоды, которые можно использовать при реализации подписания из портальной\nчасти:\nsignDocument - метод для подписания документов ЕСЭДО.\nShowFileChooser — метод для открытия диалогового окна для выбора файла ЭЦП.\ngetKeyInfo — метод возвращает информацию о ключе. Открывает диалоговое окно\nдля выбора ключа.\nПараметры метода signDocument:\n@param digest Дайджест\n@param files Список файлов\n@param type Тип подписи\n@param alg Алгоритм подписи\n@param dataForSign данные для подписи\n@return {@link String} в json формате\nПараметры метода getKeyInfo:\n@param storageName Имя хранилища ключа\n@return Объект {@link ResponseMessage} в json формате, содержащий объект\n{@link KeyInfo}\nДля подписания документа необходимо передать полученные данные из REST API\nSynergy rest/api/docflow/doc/document_info и метода getKeyInfo в метод\nsignDocument. Возвращенный ответ в формате base64 передать в REST API\nSynergy rest/api/docflow/sign.",
    "Chapter 1. Introduction\nРевизия VCS: 3c3e04345\nДата сборки документа: \n\t\t\t\t\t2023.11.09 17:03:53\nARTA SYNERGY management platform allows building full cycle of company\nmanagement from setting objectives to planning, from control of execution to\ncollection and assessment of results. The platform has single storage for\ncontent, knowledge base, quick semantic information search and other\nfeatures. In other words, everything necessary for support of interaction\nbetween people jointly collaborating over common assignments."
  ],
  "metadatas": [
    {
      "source": "Next",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.intro.html"
    },
    {
      "source": "1. Introduction",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.intro.html"
    },
    {
      "source": "2. Terms, abbreviations and legend",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.termin.html"
    },
    {
      "source": "3. General information",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.svedeniy.html"
    },
    {
      "source": "Disposition of document",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.s32.html"
    },
    {
      "source": "System composition",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.s34.html"
    },
    {
      "source": "4. Work of employees in the System",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.sistema.html"
    },
    {
      "source": "Main interface elements",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.interface.html"
    },
    {
      "source": "5. \"Work flows\" module",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.workflows.html"
    },
    {
      "source": "Document flow management",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.s62.html"
    },
    {
      "source": "Work reports",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.s63.html"
    },
    {
      "source": "6. \"Daily planner\" module",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.book.html"
    },
    {
      "source": "7. \"Storage\" module",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.ch.mailanddocs.html"
    },
    {
      "source": "Registries",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.storage.registries.html"
    },
    {
      "source": "Documents",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.chancery.s1.html"
    },
    {
      "source": "8. \"Projects\" module",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.proekt.html"
    },
    {
      "source": "Setting assignee ones for project execution",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.s82.html"
    },
    {
      "source": "Approving project",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.s83.html"
    },
    {
      "source": "Forming project",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.s84.html"
    },
    {
      "source": "Assessment and registration",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.s86.html"
    },
    {
      "source": "Project search",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.projects.search.html"
    },
    {
      "source": "Project reports",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.s87.html"
    },
    {
      "source": "9. \"Objectives and indicators\" module",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.strategiy.html"
    },
    {
      "source": "Measures",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.pokazately.html"
    },
    {
      "source": "Indicator control panel",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.s101.html"
    },
    {
      "source": "Viewing, creating, editing and deleting dictionary indicators",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.s102.html"
    },
    {
      "source": "Indicator value input",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.s103.html"
    },
    {
      "source": "Приложение: Автоматически генерируемые системные показатели",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.app_1.html"
    },
    {
      "source": "10. Employees Module",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.staff.html"
    },
    {
      "source": "Reserve",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.employees.reserve.html"
    },
    {
      "source": "Address book",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.addressbook.html"
    },
    {
      "source": "11. \"Settings\" module",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.regulyator.html"
    },
    {
      "source": "Notification settings",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.s133.html"
    },
    {
      "source": "Route settings",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.s134.html"
    },
    {
      "source": "12. Instant messaging module",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.instant_messenger.html"
    },
    {
      "source": "13. Справка",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.help.html"
    },
    {
      "source": "14. Attachments",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.appendix.html"
    },
    {
      "source": "Руководство по установке модуля Arta Synergy в программе NCALayer",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.a2.html"
    },
    {
      "source": "Next",
      "url": "http://tdd.lan.arta.kz/docs/synergy/tags/minsky/user-manual/html/en.intro.html"
    }
  ],
  "ids": [
    "1",
    "2",
    "3",
    "4",
    "5",
    "6",
    "7",
    "8",
    "9",
    "10",
    "11",
    "12",
    "13",
    "14",
    "15",
    "16",
    "17",
    "18",
    "19",
    "20",
    "21",
    "22",
    "23",
    "24",
    "25",
    "26",
    "27",
    "28",
    "29",
    "30",
    "31",
    "32",
    "33",
    "34",
    "35",
    "36",
    "37",
    "38",
    "39"
  ]
}